#pragma once

// Mordhau (Dumped by Hinnie) SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

namespace SDK
{
//---------------------------------------------------------------------------
//Classes
//---------------------------------------------------------------------------

// Class Mordhau.AdvancedCharacter
// 0x0490 (0x0BD0 - 0x0740)
class AAdvancedCharacter : public ACharacter
{
public:
	int                                                TickSkip;                                                 // 0x0740(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                AnimationTickSkip;                                        // 0x0744(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                OutOfBoundsCounter;                                       // 0x0748(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              OutOfBoundsSince;                                         // 0x074C(0x0004) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x14];                                      // 0x0750(0x0014) MISSED OFFSET
	bool                                               bIsDead;                                                  // 0x0764(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               bIsBurning;                                               // 0x0765(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               bIsRagdollFalling;                                        // 0x0766(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x1];                                       // 0x0767(0x0001) MISSED OFFSET
	struct FName                                       RagdollFallingFromCollisionProfile;                       // 0x0768(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bIsUsingRagdollFallingCollision;                          // 0x0770(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x3];                                       // 0x0771(0x0003) MISSED OFFSET
	float                                              RagdollFallingFromPerchRadius;                            // 0x0774(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UPhysicsAsset*                               RagdollFallingFromPhysicsAsset;                           // 0x0778(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              IsBurningSmoothed;                                        // 0x0780(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              DistanceIntoFireFieldSmoothed;                            // 0x0784(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              DistanceIntoFireField;                                    // 0x0788(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              DistanceIntoSmokeFieldSmoothed;                           // 0x078C(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              DistanceIntoSmokeField;                                   // 0x0790(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              LookUpValue;                                              // 0x0794(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FScriptMulticastDelegate                    OnCharacterDied;                                          // 0x0798(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnCharacterDestroyed;                                     // 0x07A8(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	int                                                UniqueAdvancedCharacterIndex;                             // 0x07B8(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              MouseSmoothedTurnValue;                                   // 0x07BC(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              MouseSmoothingTurnVelocity;                               // 0x07C0(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              MouseSmoothedLookUpValue;                                 // 0x07C4(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              MouseSmoothingLookUpVelocity;                             // 0x07C8(0x0004) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData03[0x4];                                       // 0x07CC(0x0004) MISSED OFFSET
	struct FPrePhysTickFunction                        PrePhysTickFunction;                                      // 0x07D0(0x0058)
	float                                              LODDeltaTime;                                             // 0x0828(0x0004) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData04[0x10];                                      // 0x082C(0x0010) MISSED OFFSET
	unsigned char                                      Team;                                                     // 0x083C(0x0001) (Edit, BlueprintVisible, Net, ZeroConstructor, EditConst, IsPlainOldData)
	unsigned char                                      UnknownData05[0x3];                                       // 0x083D(0x0003) MISSED OFFSET
	struct FName                                       QueuedForDismember;                                       // 0x0840(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bQueuedDismemberIsPartial;                                // 0x0848(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bQueuedDismemberIsBluntForce;                             // 0x0849(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData06[0x2];                                       // 0x084A(0x0002) MISSED OFFSET
	struct FVector                                     MoveCompVelocityBeforeDeath;                              // 0x084C(0x000C) (BlueprintVisible, IsPlainOldData)
	float                                              LastNonZeroVelocityTime;                                  // 0x0858(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bCanReceiveClientsideHits;                                // 0x085C(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData07[0x3];                                       // 0x085D(0x0003) MISSED OFFSET
	TArray<TWeakObjectPtr<class UMaterialInstanceDynamic>> DissolveMaterialInstances;                                // 0x0860(0x0010) (ZeroConstructor)
	float                                              DissolveDuration;                                         // 0x0870(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              DissolveValue;                                            // 0x0874(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              LastSetDissolveValue;                                     // 0x0878(0x0004) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData08[0x4];                                       // 0x087C(0x0004) MISSED OFFSET
	class ULateTickComponent*                          LateTickComponent;                                        // 0x0880(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	double                                             DistanceToCameraHeuristic;                                // 0x0888(0x0008) (ZeroConstructor, IsPlainOldData)
	float                                              DistanceToCamera;                                         // 0x0890(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               bSkipAnimPoseOnClientWhenNotRendered;                     // 0x0894(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData09[0x3];                                       // 0x0895(0x0003) MISSED OFFSET
	struct FName                                       DistanceToCameraBoneToUse;                                // 0x0898(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                LODRank;                                                  // 0x08A0(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               bFancyMeshEffects;                                        // 0x08A4(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData10[0x3];                                       // 0x08A5(0x0003) MISSED OFFSET
	float                                              FancyMeshEffectsTurnOnDistance;                           // 0x08A8(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              FancyMeshEffectsTurnOffDistance;                          // 0x08AC(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bForceMaxQuality;                                         // 0x08B0(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      ReplicatedCharacterFlags;                                 // 0x08B1(0x0001) (BlueprintVisible, Net, ZeroConstructor, IsPlainOldData)
	bool                                               bWasEverPossessedByLocalPlayer;                           // 0x08B2(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData11[0x1];                                       // 0x08B3(0x0001) MISSED OFFSET
	float                                              LastPossessionTime;                                       // 0x08B4(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              MeshPauseAnimsLifetime;                                   // 0x08B8(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData12[0x4];                                       // 0x08BC(0x0004) MISSED OFFSET
	struct FName                                       RagdollFallingProfileName;                                // 0x08C0(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UPhysicsAsset*                               RagdollFallingPhysicsAsset;                               // 0x08C8(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              RagdollFallingGetUpDuration;                              // 0x08D0(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FVector                                     RagdollFallingApplyForce;                                 // 0x08D4(0x000C) (Edit, BlueprintVisible, IsPlainOldData)
	struct FVector                                     RagdollFallingApplyForceAir;                              // 0x08E0(0x000C) (Edit, BlueprintVisible, IsPlainOldData)
	unsigned char                                      UnknownData13[0x4];                                       // 0x08EC(0x0004) MISSED OFFSET
	struct FName                                       RagdollFallingApplyForceBoneName;                         // 0x08F0(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              RagdollFallingGetUpStartTime;                             // 0x08F8(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              RagdollFallingStartTime;                                  // 0x08FC(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              RagdollFallingBlendOutSpeed;                              // 0x0900(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              RagdollFallingMinTime;                                    // 0x0904(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              RagdollFallingMinVelocityToGetUp;                         // 0x0908(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              RagdollFallingTimeAtMinVelocityToGetUp;                   // 0x090C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              PhysicsBlendWeight;                                       // 0x0910(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              PhysicsBlendTarget;                                       // 0x0914(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              PhysicsBlendSpeed;                                        // 0x0918(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData14[0x14];                                      // 0x091C(0x0014) MISSED OFFSET
	float                                              JumpCooldown;                                             // 0x0930(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bJumped;                                                  // 0x0934(0x0001) (ZeroConstructor, IsPlainOldData)
	bool                                               bIsAirborneFromJump;                                      // 0x0935(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData15[0x2];                                       // 0x0936(0x0002) MISSED OFFSET
	float                                              AirborneTime;                                             // 0x0938(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              SmokeDistanceMaxValue;                                    // 0x093C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              SmokeDistanceSmoothInterpSpeed;                           // 0x0940(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	TWeakObjectPtr<class AMasterField>                 CurrentSmokeField;                                        // 0x0944(0x0008) (ZeroConstructor, IsPlainOldData)
	float                                              IsBurningSmoothInterpSpeed;                               // 0x094C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              FireDistanceMaxValue;                                     // 0x0950(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              FireDistanceSmoothInterpSpeed;                            // 0x0954(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	TWeakObjectPtr<class AMasterField>                 CurrentFireField;                                         // 0x0958(0x0008) (ZeroConstructor, IsPlainOldData)
	TWeakObjectPtr<class AController>                  FireInstigator;                                           // 0x0960(0x0008) (ZeroConstructor, IsPlainOldData)
	TWeakObjectPtr<class AActor>                       FireAgent;                                                // 0x0968(0x0008) (ZeroConstructor, IsPlainOldData)
	float                                              FireDamage;                                               // 0x0970(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              FireDamageTick;                                           // 0x0974(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              FireEnd;                                                  // 0x0978(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              LastFireDamageTime;                                       // 0x097C(0x0004) (ZeroConstructor, IsPlainOldData)
	bool                                               bMeshesReceiveDecals;                                     // 0x0980(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData16[0x7];                                       // 0x0981(0x0007) MISSED OFFSET
	class AMordhauProjectile*                          CurrentProjectile;                                        // 0x0988(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bTurnUsesControllerInputYawScale;                         // 0x0990(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bAddForwardAxisToMovementInput;                           // 0x0991(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bAddRightAxisToMovementInput;                             // 0x0992(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData17[0x1];                                       // 0x0993(0x0001) MISSED OFFSET
	float                                              SpawnTurnValue;                                           // 0x0994(0x0004) (BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData)
	float                                              LookUpLimit;                                              // 0x0998(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              LookDownLimit;                                            // 0x099C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              TurnLimit;                                                // 0x09A0(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      ReplicatedLookUpValue;                                    // 0x09A4(0x0001) (BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData18[0x3];                                       // 0x09A5(0x0003) MISSED OFFSET
	float                                              LookUpValueSmoothingTarget;                               // 0x09A8(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              LookUpValueSmoothingFrom;                                 // 0x09AC(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              LookUpValueSmoothingStartTime;                            // 0x09B0(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              TurnRateCap;                                              // 0x09B4(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              TurnRateCapTarget;                                        // 0x09B8(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              LookUpRateCap;                                            // 0x09BC(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              LookUpRateCapTarget;                                      // 0x09C0(0x0004) (ZeroConstructor, IsPlainOldData)
	bool                                               bTurnRateIgnoresCap;                                      // 0x09C4(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData19[0x3];                                       // 0x09C5(0x0003) MISSED OFFSET
	float                                              TurnCapRemaining;                                         // 0x09C8(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              LookUpCapRemaining;                                       // 0x09CC(0x0004) (ZeroConstructor, IsPlainOldData)
	struct FVector                                     LastObservedLocation;                                     // 0x09D0(0x000C) (IsPlainOldData)
	struct FVector                                     AccumulatedLocationLag;                                   // 0x09DC(0x000C) (BlueprintVisible, IsPlainOldData)
	TArray<struct FFloatAndVector>                     DelayedLocationDeltas;                                    // 0x09E8(0x0010) (ZeroConstructor)
	float                                              CurrentLocationLagInduction;                              // 0x09F8(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              LocationLagInductionTarget;                               // 0x09FC(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              LocationLagInductionChangeSpeed;                          // 0x0A00(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              LocationLagInductionCounterweight;                        // 0x0A04(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FVector                                     LastObservedLook;                                         // 0x0A08(0x000C) (IsPlainOldData)
	struct FVector                                     AccumulatedLookLag;                                       // 0x0A14(0x000C) (BlueprintVisible, IsPlainOldData)
	TArray<struct FFloatAndVector>                     DelayedLookDeltas;                                        // 0x0A20(0x0010) (ZeroConstructor)
	float                                              CurrentLookLagInduction;                                  // 0x0A30(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              LookLagInductionTarget;                                   // 0x0A34(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              LookLagInductionChangeSpeed;                              // 0x0A38(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              LookLagInductionCounterweight;                            // 0x0A3C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bPerformCustomDepthHighlight;                             // 0x0A40(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bIsHighlighted;                                           // 0x0A41(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               bIsInteractable;                                          // 0x0A42(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bAnimUpdateRateOptimizations;                             // 0x0A43(0x0001) (ZeroConstructor, IsPlainOldData)
	bool                                               bIsNonCombatCharacter;                                    // 0x0A44(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bWillStopMelee;                                           // 0x0A45(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bWillBleedOutOnKill;                                      // 0x0A46(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData20[0x1];                                       // 0x0A47(0x0001) MISSED OFFSET
	float                                              BleedingOutRemainingTime;                                 // 0x0A48(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bIsBleedingOut;                                           // 0x0A4C(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData21[0x3];                                       // 0x0A4D(0x0003) MISSED OFFSET
	TWeakObjectPtr<class AActor>                       LastDamageAgent;                                          // 0x0A50(0x0008) (ZeroConstructor, IsPlainOldData)
	TWeakObjectPtr<class AActor>                       LastDamageSource;                                         // 0x0A58(0x0008) (ZeroConstructor, IsPlainOldData)
	TWeakObjectPtr<class AController>                  LastDamageInstigator;                                     // 0x0A60(0x0008) (ZeroConstructor, IsPlainOldData)
	class UParticleSystem*                             DeathParticles;                                           // 0x0A68(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FName                                       DeathParticlesSocket;                                     // 0x0A70(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      Health;                                                   // 0x0A78(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      ReplicatedHealth;                                         // 0x0A79(0x0001) (BlueprintVisible, Net, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData22[0x2];                                       // 0x0A7A(0x0002) MISSED OFFSET
	float                                              HealthRegenDelay;                                         // 0x0A7C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      HealthRegenPerTick;                                       // 0x0A80(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData23[0x3];                                       // 0x0A81(0x0003) MISSED OFFSET
	float                                              HealthRegenTickRate;                                      // 0x0A84(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bIgnoreGameStateHealthRegenRestriction;                   // 0x0A88(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData24[0x3];                                       // 0x0A89(0x0003) MISSED OFFSET
	float                                              NextHealthTick;                                           // 0x0A8C(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              OutOfBoundsKillTime;                                      // 0x0A90(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bIsAllowedOutOfBounds;                                    // 0x0A94(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData25[0x3];                                       // 0x0A95(0x0003) MISSED OFFSET
	float                                              ReceivedDamageModifier;                                   // 0x0A98(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              ReceivedTeamDamageModifier;                               // 0x0A9C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              ReceivedFireDamageModifier;                               // 0x0AA0(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              ReceivedRangedDamageModifier;                             // 0x0AA4(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              ReceivedDamageAbsorption;                                 // 0x0AA8(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              KnockbackFlinch;                                          // 0x0AAC(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UClass*                                      HitEffect;                                                // 0x0AB0(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UParticleSystem*                             BurningParticles;                                         // 0x0AB8(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FName                                       BurningAttachSocket;                                      // 0x0AC0(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class USoundCue*                                   BurningSound;                                             // 0x0AC8(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class USoundCue*                                   FallDamageSound;                                          // 0x0AD0(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FName                                       FallDamageSoundAttachToBone;                              // 0x0AD8(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	TWeakObjectPtr<class UParticleSystemComponent>     CurrentBurningParticles;                                  // 0x0AE0(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	TWeakObjectPtr<class UAudioComponent>              CurrentBurningSound;                                      // 0x0AE8(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	struct FNetDamage                                  NetDamage;                                                // 0x0AF0(0x0020) (Net)
	float                                              DeathTime;                                                // 0x0B10(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              RagdollStartTime;                                         // 0x0B14(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               bForceLongDeathYell;                                      // 0x0B18(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData26[0x3];                                       // 0x0B19(0x0003) MISSED OFFSET
	int                                                FootstepAudioComponentCount;                              // 0x0B1C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	TArray<class UAudioComponent*>                     FootstepAudioComponents;                                  // 0x0B20(0x0010) (ExportObject, ZeroConstructor)
	unsigned char                                      UnknownData27[0x8];                                       // 0x0B30(0x0008) MISSED OFFSET
	class USoundCue*                                   HurtYell;                                                 // 0x0B38(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class USoundCue*                                   DeathYell;                                                // 0x0B40(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	TWeakObjectPtr<class UAudioComponent>              DeathScreamPtr;                                           // 0x0B48(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	int                                                DedicatedServerAnimFrameSkipLOD;                          // 0x0B50(0x0004) (Edit, BlueprintVisible, ZeroConstructor, Config, GlobalConfig, IsPlainOldData)
	unsigned char                                      UnknownData28[0x4];                                       // 0x0B54(0x0004) MISSED OFFSET
	struct FName                                       AdditiveOverrideType;                                     // 0x0B58(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              AdditiveOverrideEndTime;                                  // 0x0B60(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              AdditiveOverrideStartTime;                                // 0x0B64(0x0004) (ZeroConstructor, IsPlainOldData)
	struct FName                                       LastFlinchAdditiveName;                                   // 0x0B68(0x0008) (ZeroConstructor, IsPlainOldData)
	float                                              LastFlinchAdditiveTime;                                   // 0x0B70(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              LastSetBloodIntensity;                                    // 0x0B74(0x0004) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      MaxWounds;                                                // 0x0B78(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      LastWound;                                                // 0x0B79(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData29[0x6];                                       // 0x0B7A(0x0006) MISSED OFFSET
	TArray<struct FWoundMaterialData>                  Wounds;                                                   // 0x0B80(0x0010) (BlueprintVisible, ZeroConstructor)
	struct FName                                       BloodIntensityParamName;                                  // 0x0B90(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	TArray<class USkeletalMeshComponent*>              BloodReceivingSkeletalMeshes;                             // 0x0B98(0x0010) (BlueprintVisible, ExportObject, ZeroConstructor)
	TEnumAsByte<EPhysicalSurface>                      CharacterSurface;                                         // 0x0BA8(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData30[0x7];                                       // 0x0BA9(0x0007) MISSED OFFSET
	TArray<struct FSphericalLimbBounds>                SphericalLimbs;                                           // 0x0BB0(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	float                                              RagdollForceMultIfDmgAgent;                               // 0x0BC0(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bForceRagdollIfDmgAgent;                                  // 0x0BC4(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData31[0xB];                                       // 0x0BC5(0x000B) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Mordhau.AdvancedCharacter");
		return ptr;
	}


	void UnHighlight();
	void TurnNotAbsolute(float Value);
	void TurnAtRate(float Val);
	void Turn(float Val, bool bIsAbsolute);
	bool Trip();
	void Suicide();
	void StopRegen(float ExtraTime);
	void StopHealthRegen(float ExtraTime);
	void StopBurningCosmetic();
	void StartRagdollWithBlend(float BlendDuration);
	void StartRagdoll();
	void StartBurningCosmetic();
	void StartBurning(float Duration, float Damage, float Tick, class AActor* DamageAgent, class AController* InstigatorController);
	class UParticleSystemComponent* SpawnParticlesAttached(class UParticleSystem* Particle, const struct FVector& Location, const struct FRotator& Rotation, TEnumAsByte<EAttachLocation> AttachType, const struct FName& Socket, bool bForce);
	void SetOnSmoke(class AMasterField* SmokeField);
	void SetOnFire(class AMasterField* FireField);
	void SetLookLagInductionTarget(float Amount, float ChangeSpeed);
	void SetLocationLagInductionTarget(float Amount, float ChangeSpeed);
	void SetIsRagdollFalling(bool bInIsRagdollFalling);
	void SetAdditiveOverrideType(const struct FName& NewType, float Duration);
	void ServerTrip();
	void ServerSuicide();
	void ServerLookUp(float NewLookUp);
	void ResetLookLagInductionTarget();
	void ResetLocationLagInductionTarget();
	void ResetLagInductionTargets();
	void ResetAdditiveOverrideType();
	void RequestTrip();
	void RequestSuicide();
	void RequestMeshEnablePhysics(float Duration);
	void ReplicateHealth();
	void RegisterMaterialToDissolve(class UMaterialInstanceDynamic* Mat);
	void PlayHitEffectParticle(const struct FVector& Location, const struct FRotator& Rotation, const struct FName& bone, bool bFindOptimalSpot);
	class UAudioComponent* PlayCharacterSound(class USoundBase* Sound, const struct FName& bone, const struct FVector& InLocation, TEnumAsByte<EAttachLocation> AttachLocation, bool bAttach, class USoundAttenuation* Override, float VolumeMultiplier, float PitchMultiplier);
	void OnTookDamage(bool bWillKill, EMordhauDamageType Type, unsigned char SubType, const struct FName& bone, const struct FVector& Point, class AActor* Source, class AActor* Agent);
	void OnRep_Team();
	void OnRep_SpawnTurnValue();
	void OnRep_ReplicatedLookUpValue();
	void OnRep_ReplicatedHealth();
	void OnRep_ReplicatedCharacterFlags(unsigned char OldValue);
	void OnRep_NetDamage();
	void OnKilled(class AController* EventInstigator);
	void OnInteractionStart(class AAdvancedCharacter* Character);
	void OnInteractionEnd();
	void OnHit(class AActor* Actor, const struct FName& bone, const struct FVector& WorldLocation, unsigned char Tier, unsigned char SurfaceType);
	void OnHighlightStart();
	void OnHighlightEnd();
	void OnHealthChanged();
	void OnDied(float Angle, EMordhauDamageType Type, unsigned char SubType, const struct FName& bone, const struct FVector& Point, class AActor* Source, class AActor* Agent);
	void OnCosmeticHit(EMordhauDamageType DamageType, unsigned char SubType, const struct FHitResult& Hit, class AActor* Agent);
	void OnAfterDied(float Angle, EMordhauDamageType Type, unsigned char SubType, const struct FName& bone, const struct FVector& Point, class AActor* Source, class AActor* Agent);
	void OffsetHealth(int Amount, bool bReplicate);
	void MoveRight(float Val);
	void MoveForward(float Val);
	float MordhauTakeDamage(float DamageAmount, const struct FHitResult& Hit, EMordhauDamageType DamageType, unsigned char DamageSubType, class AActor* Source, class AActor* Agent, class AController* EventInstigator);
	void LookUpNotAbsolute(float Value);
	void LookUpAtRate(float Val);
	void LookUp(float Val, bool bIsAbsolute);
	void LeftOutOfBoundsArea();
	bool Knockback(const struct FVector& Amount);
	bool IsOutOfBounds();
	bool IsLocallyPlayerControlled();
	bool IsLocallyControlledOrUncontrolled();
	bool IsAirborne();
	void InteractionStart(class AAdvancedCharacter* Character);
	void InteractionEnd();
	void Highlight();
	float GetRawLookUpValue();
	float GetOutOfBoundsTimeUntilDeath();
	float GetLookUpValue();
	bool GetIsDead();
	bool GetIsBurning();
	float GetDistanceIntoSmokeFieldSmoothed();
	float GetDistanceIntoSmokeField();
	bool GetBestStickyLocation(const struct FVector& InLocation, struct FVector* OutLocation, struct FVector* OutNormal, struct FName* OutBone);
	unsigned char GetArmorTierForBone(const struct FName& BoneName);
	float GetAdditiveOverrideTypeNormalizedTime();
	struct FName GetAdditiveOverrideType();
	void EnteredOutOfBoundsArea();
	void DouseFire();
	bool CanInteract(class AAdvancedCharacter* Character);
	bool CanBleedOutFromHit(const struct FHitResult& HitResult, EMordhauDamageType Type, unsigned char SubType, class AActor* Source, class AActor* Agent, class AController* EventInstigator);
	void BPLODTick(float DeltaTime);
	void BeginFlinchAdditiveOverride(const struct FName& FlinchOverrideName, const struct FName& AltFlinchOverrideName, float Duration, float Degree, bool bIsHead, float SnapDegreeToSteps);
	void AssignNetDamage(unsigned char InType, unsigned char InSubType, unsigned char InBone, const struct FVector& InPoint, bool bInWillKill, bool bInSimulateFlinch, bool bInIDBit, class AActor* InDamageSource, class AActor* InDamageAgent);
	void ApplyRagdollForce(float Angle, EMordhauDamageType Type, unsigned char SubType, const struct FName& bone, const struct FVector& Point, class AActor* Source, class AActor* Agent);
	void AddWound(const struct FVector& ImpactPoint, const struct FVector& ImpactNormal, const struct FName& bone, class AActor* Agent, EMordhauDamageType DamageType, unsigned char DamageSubType);
	void AddTurnDegrees(float Delta);
};


// Class Mordhau.AdvancedCharacterAnimInstance
// 0x00D0 (0x0430 - 0x0360)
class UAdvancedCharacterAnimInstance : public UAnimInstance
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0360(0x0008) MISSED OFFSET
	bool                                               bWantsGrounding;                                          // 0x0368(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x3];                                       // 0x0369(0x0003) MISSED OFFSET
	struct FVector                                     RootTranslationOffsetInternal;                            // 0x036C(0x000C) (IsPlainOldData)
	struct FVector                                     RootTranslationOffset;                                    // 0x0378(0x000C) (BlueprintVisible, IsPlainOldData)
	struct FRotator                                    RootRotationOffsetInternal;                               // 0x0384(0x000C) (IsPlainOldData)
	struct FRotator                                    RootRotationOffset;                                       // 0x0390(0x000C) (BlueprintVisible, IsPlainOldData)
	struct FVector                                     RootRotationPivot;                                        // 0x039C(0x000C) (BlueprintVisible, IsPlainOldData)
	float                                              TranslationInterpSpeed;                                   // 0x03A8(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              RotationInterpSpeed;                                      // 0x03AC(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              RootRotationOffsetFactor;                                 // 0x03B0(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              LimbRotationOffsetFactor;                                 // 0x03B4(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FVector2D                                   RootLiftLimits;                                           // 0x03B8(0x0008) (Edit, BlueprintVisible, IsPlainOldData)
	float                                              GroundingWeight;                                          // 0x03C0(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FVector                                     AccumulatedLocationLag;                                   // 0x03C4(0x000C) (BlueprintVisible, IsPlainOldData)
	struct FRotator                                    AccumulatedTurnLag;                                       // 0x03D0(0x000C) (BlueprintVisible, IsPlainOldData)
	bool                                               bIsAirborne;                                              // 0x03DC(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x3];                                       // 0x03DD(0x0003) MISSED OFFSET
	float                                              LastLand;                                                 // 0x03E0(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              LastJump;                                                 // 0x03E4(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              AirborneTime;                                             // 0x03E8(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bJumped;                                                  // 0x03EC(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bAirborneFromJump;                                        // 0x03ED(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bIsDead;                                                  // 0x03EE(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData03[0x1];                                       // 0x03EF(0x0001) MISSED OFFSET
	float                                              DeathDirection;                                           // 0x03F0(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData04[0x4];                                       // 0x03F4(0x0004) MISSED OFFSET
	struct FName                                       AdditiveOverrideType;                                     // 0x03F8(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              AdditiveOverrideWeight;                                   // 0x0400(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              AdditiveOverrideNoneTime;                                 // 0x0404(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              AdditiveOverrideTypeNormalizedTime;                       // 0x0408(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              FlinchDirection;                                          // 0x040C(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              FlinchIsHead;                                             // 0x0410(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              AltFlinchDirection;                                       // 0x0414(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              AltFlinchIsHead;                                          // 0x0418(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              LastDeltaSeconds;                                         // 0x041C(0x0004) (ZeroConstructor, IsPlainOldData)
	bool                                               bRanPostEvaluateThisFrame;                                // 0x0420(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData05[0xF];                                       // 0x0421(0x000F) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Mordhau.AdvancedCharacterAnimInstance");
		return ptr;
	}

};


// Class Mordhau.AdvancedCharacterMovement
// 0x00F0 (0x0860 - 0x0770)
class UAdvancedCharacterMovement : public UCharacterMovementComponent
{
public:
	float                                              LastFallingCheckVelocityZ;                                // 0x0770(0x0004) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0774(0x0004) MISSED OFFSET
	class UCrowdManager*                               CrowdManager;                                             // 0x0778(0x0008) (ZeroConstructor, IsPlainOldData)
	bool                                               bUseMordhauRotationInterpMode;                            // 0x0780(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x3];                                       // 0x0781(0x0003) MISSED OFFSET
	float                                              MordhauRotationSmoothStartTime;                           // 0x0784(0x0004) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x8];                                       // 0x0788(0x0008) MISSED OFFSET
	struct FQuat                                       MordhauRotationSmoothFrom;                                // 0x0790(0x0010) (IsPlainOldData)
	float                                              StillTimeWhileRagdollFalling;                             // 0x07A0(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              PerchRadiusThresholdRagdollFalling;                       // 0x07A4(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              MinVelocityForFallDamage;                                 // 0x07A8(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              FallDamageOffset;                                         // 0x07AC(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              FallDamageFactor;                                         // 0x07B0(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              RagdollMinVelocityForFallDamage;                          // 0x07B4(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              RagdollFallDamageOffset;                                  // 0x07B8(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              RagdollFallDamageFactor;                                  // 0x07BC(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bReverseBackwardsTurning;                                 // 0x07C0(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bUsePendingRotationToOrientMovement;                      // 0x07C1(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData03[0x2];                                       // 0x07C2(0x0002) MISSED OFFSET
	struct FVector                                     PreviousVelocity;                                         // 0x07C4(0x000C) (BlueprintVisible, IsPlainOldData)
	float                                              PendingTurnValue;                                         // 0x07D0(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bIgnoreMovementInput;                                     // 0x07D4(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData04[0xB];                                       // 0x07D5(0x000B) MISSED OFFSET
	TArray<unsigned char>                              ChildrenSkipperCachedArray;                               // 0x07E0(0x0010) (ZeroConstructor)
	struct FVector                                     OffsetMeshTranslation;                                    // 0x07F0(0x000C) (IsPlainOldData)
	struct FVector                                     OffsetExtrapolation;                                      // 0x07FC(0x000C) (IsPlainOldData)
	struct FVector                                     OffsetExtrapolationTarget;                                // 0x0808(0x000C) (IsPlainOldData)
	struct FVector                                     OffsetCorrectionLeftover;                                 // 0x0814(0x000C) (IsPlainOldData)
	struct FVector                                     OffsetNetSmoothLeftover;                                  // 0x0820(0x000C) (IsPlainOldData)
	struct FVector                                     OffsetNetSmoothPending;                                   // 0x082C(0x000C) (IsPlainOldData)
	struct FVector                                     MovementComponentMeshOffset;                              // 0x0838(0x000C) (IsPlainOldData)
	float                                              AuthNetSmoothTime;                                        // 0x0844(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              AuthNetMaxSmoothDist;                                     // 0x0848(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bDisableAuthNetSmoothing;                                 // 0x084C(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData05[0x3];                                       // 0x084D(0x0003) MISSED OFFSET
	int                                                SkipPredictionForAnimTickSkipOrGreater;                   // 0x0850(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData06[0xC];                                       // 0x0854(0x000C) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Mordhau.AdvancedCharacterMovement");
		return ptr;
	}

};


// Class Mordhau.AdvProjectileMovementComponent
// 0x0008 (0x01A8 - 0x01A0)
class UAdvProjectileMovementComponent : public UProjectileMovementComponent
{
public:
	float                                              DragDeceleration;                                         // 0x01A0(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x01A4(0x0004) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Mordhau.AdvProjectileMovementComponent");
		return ptr;
	}

};


// Class Mordhau.Archetype
// 0x0008 (0x0030 - 0x0028)
class UArchetype : public UObject
{
public:
	int                                                CharacterPoints;                                          // 0x0028(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x002C(0x0004) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Mordhau.Archetype");
		return ptr;
	}

};


// Class Mordhau.MordhauInventoryItem
// 0x0030 (0x0058 - 0x0028)
class UMordhauInventoryItem : public UObject
{
public:
	class UTexture2D*                                  ItemIcon;                                                 // 0x0028(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                ItemDefID;                                                // 0x0030(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0034(0x0004) MISSED OFFSET
	struct FText                                       ItemName;                                                 // 0x0038(0x0018) (Edit, BlueprintVisible)
	EItemRarity                                        ItemRarity;                                               // 0x0050(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x7];                                       // 0x0051(0x0007) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Mordhau.MordhauInventoryItem");
		return ptr;
	}

};


// Class Mordhau.MordhauWearable
// 0x0140 (0x0198 - 0x0058)
class UMordhauWearable : public UMordhauInventoryItem
{
public:
	EWearableSlot                                      UseColorsFromSlot;                                        // 0x0058(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0059(0x0007) MISSED OFFSET
	class UTexture2D*                                  AlbedoMap;                                                // 0x0060(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UTexture2D*                                  NormalMap;                                                // 0x0068(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UTexture2D*                                  RoughnessMap;                                             // 0x0070(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FColor                                      Albedo;                                                   // 0x0078(0x0004) (Edit, BlueprintVisible, IsPlainOldData)
