#pragma once

// Mordhau (Dumped by Hinnie) SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct STRUCT_HordeSkillInfo.STRUCT_HordeSkillInfo
// 0x0064
struct FSTRUCT_HordeSkillInfo
{
	struct FText                                       Name_2_8459F59C4AAEDBBA47BB81AE124BB52E;                  // 0x0000(0x0018) (Edit, BlueprintVisible)
	struct FText                                       Description_4_41D6557640694E36847F55816D9B51CC;           // 0x0018(0x0018) (Edit, BlueprintVisible)
	struct FText                                       NextLevelDescription_25_F49CC24C4D5129F7AEF3B6B12D0E2D52; // 0x0030(0x0018) (Edit, BlueprintVisible)
	class UTexture2D*                                  Icon_7_3A036B784ABD60C51A51ED9B0BBE1B1E;                  // 0x0048(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               Ultimate_9_9EFF15F948C5EA113377D8A6DF7E663F;              // 0x0050(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0051(0x0003) MISSED OFFSET
	float                                              PercentA_12_52BF5AC346D2737915D561B799B1EC30;             // 0x0054(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              PercentB_14_049453AF4D0CB13A5AF0DDB37E5DDAEA;             // 0x0058(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                IntegerA_17_47C2495549B8EF0EE594848496D19298;             // 0x005C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              TimeA_22_4DCD6DA04061853B1D75E69916B14260;                // 0x0060(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
