#pragma once

// Mordhau (Dumped by Hinnie) SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

namespace SDK
{
//---------------------------------------------------------------------------
//Enums
//---------------------------------------------------------------------------

// Enum PlayFab.EGameBuildStatus
enum class EGameBuildStatus : uint8_t
{
	pfenum_Available               = 0,
	pfenum_Validating              = 1,
	pfenum_InvalidBuildPackage     = 2,
	pfenum_Processing              = 3,
	pfenum_FailedToProcess         = 4,
	pfenum_MAX                     = 5
};


// Enum PlayFab.EStatisticResetIntervalOption
enum class EStatisticResetIntervalOption : uint8_t
{
	pfenum_Never                   = 0,
	pfenum_Hour                    = 1,
	pfenum_Day                     = 2,
	pfenum_Week                    = 3,
	pfenum_Month                   = 4,
	pfenum_MAX                     = 5
};


// Enum PlayFab.EStatisticAggregationMethod
enum class EStatisticAggregationMethod : uint8_t
{
	pfenum_Last                    = 0,
	pfenum_Min                     = 1,
	pfenum_Max                     = 2,
	pfenum_Sum                     = 3
};


// Enum PlayFab.ERegion
enum class ERegion : uint8_t
{
	pfenum_USCentral               = 0,
	pfenum_USEast                  = 1,
	pfenum_EUWest                  = 2,
	pfenum_Singapore               = 3,
	pfenum_Japan                   = 4,
	pfenum_Brazil                  = 5,
	pfenum_Australia               = 6,
	pfenum_MAX                     = 7
};


// Enum PlayFab.EPfSourceType
enum class EPfSourceType : uint8_t
{
	pfenum_Admin                   = 0,
	pfenum_BackEnd                 = 1,
	pfenum_GameClient              = 2,
	pfenum_GameServer              = 3,
	pfenum_Partner                 = 4,
	pfenum_Custom                  = 5,
	pfenum_API                     = 6,
	pfenum_MAX                     = 7
};


// Enum PlayFab.EAuthTokenType
enum class EAuthTokenType : uint8_t
{
	pfenum_Email                   = 0,
	pfenum_MAX                     = 1
};


// Enum PlayFab.ETaskInstanceStatus
enum class ETaskInstanceStatus : uint8_t
{
	pfenum_Succeeded               = 0,
	pfenum_Starting                = 1,
	pfenum_InProgress              = 2,
	pfenum_Failed                  = 3,
	pfenum_Aborted                 = 4,
	pfenum_Stalled                 = 5,
	pfenum_MAX                     = 6
};


// Enum PlayFab.EResolutionOutcome
enum class EResolutionOutcome : uint8_t
{
	pfenum_Revoke                  = 0,
	pfenum_Reinstate               = 1,
	pfenum_Manual                  = 2,
	pfenum_MAX                     = 3
};


// Enum PlayFab.EPushSetupPlatform
enum class EPushSetupPlatform : uint8_t
{
	pfenum_GCM                     = 0,
	pfenum_APNS                    = 1,
	pfenum_APNS_SANDBOX            = 2,
	pfenum_MAX                     = 3
};


// Enum PlayFab.EScheduledTaskType
enum class EScheduledTaskType : uint8_t
{
	pfenum_CloudScript             = 0,
	pfenum_ActionsOnPlayerSegment  = 1,
	pfenum_CloudScriptAzureFunctions = 2,
	pfenum_MAX                     = 3
};


// Enum PlayFab.EUserDataPermission
enum class EUserDataPermission : uint8_t
{
	pfenum_Private                 = 0,
	pfenum_Public                  = 1,
	pfenum_MAX                     = 2
};


// Enum PlayFab.EMatchmakeStatus
enum class EMatchmakeStatus : uint8_t
{
	pfenum_Complete                = 0,
	pfenum_Waiting                 = 1,
	pfenum_GameNotFound            = 2,
	pfenum_NoAvailableSlots        = 3,
	pfenum_SessionClosed           = 4,
	pfenum_MAX                     = 5
};


// Enum PlayFab.ETransactionStatus
enum class ETransactionStatus : uint8_t
{
	pfenum_CreateCart              = 0,
	pfenum_Init                    = 1,
	pfenum_Approved                = 2,
	pfenum_Succeeded               = 3,
	pfenum_FailedByProvider        = 4,
	pfenum_DisputePending          = 5,
	pfenum_RefundPending           = 6,
	pfenum_Refunded                = 7,
	pfenum_RefundFailed            = 8,
	pfenum_ChargedBack             = 9,
	pfenum_FailedByUber            = 10,
	pfenum_FailedByPlayFab         = 11,
	pfenum_Revoked                 = 12,
	pfenum_TradePending            = 13,
	pfenum_Traded                  = 14,
	pfenum_Upgraded                = 15,
	pfenum_StackPending            = 16,
	pfenum_Stacked                 = 17,
	pfenum_Other                   = 18,
	pfenum_Failed                  = 19,
	pfenum_MAX                     = 20
};


// Enum PlayFab.ECloudScriptRevisionOption
enum class ECloudScriptRevisionOption : uint8_t
{
	pfenum_Live                    = 0,
	pfenum_Latest                  = 1,
	pfenum_Specific                = 2,
	pfenum_MAX                     = 3
};


// Enum PlayFab.ETradeStatus
enum class ETradeStatus : uint8_t
{
	pfenum_Invalid                 = 0,
	pfenum_Opening                 = 1,
	pfenum_Open                    = 2,
	pfenum_Accepting               = 3,
	pfenum_Accepted                = 4,
	pfenum_Filled                  = 5,
	pfenum_Cancelled               = 6,
	pfenum_MAX                     = 7
};


// Enum PlayFab.EOperationTypes
enum class EOperationTypes : uint8_t
{
	pfenum_Created                 = 0,
	pfenum_Updated                 = 1,
	pfenum_Deleted                 = 2,
	pfenum_None                    = 3,
	pfenum_MAX                     = 4
};


// Enum PlayFab.EAzureVmSize
enum class EAzureVmSize : uint8_t
{
	pfenum_Standard_D1_v2          = 0,
	pfenum_Standard_D2_v2          = 1,
	pfenum_Standard_D3_v2          = 2,
	pfenum_Standard_D4_v2          = 3,
	pfenum_Standard_D5_v2          = 4,
	pfenum_Standard_A1_v2          = 5,
	pfenum_Standard_A2_v2          = 6,
	pfenum_Standard_A4_v2          = 7,
	pfenum_Standard_A8_v2          = 8,
	pfenum_Standard_F1             = 9,
	pfenum_Standard_F2             = 10,
	pfenum_Standard_F4             = 11,
	pfenum_Standard_F8             = 12,
	pfenum_Standard_F16            = 13,
	pfenum_Standard_F2s_v2         = 14,
	pfenum_Standard_F4s_v2         = 15,
	pfenum_Standard_F8s_v2         = 16,
	pfenum_Standard_F16s_v2        = 17,
	pfenum_Standard_A1             = 18,
	pfenum_Standard_A2             = 19,
	pfenum_Standard_A3             = 20,
	pfenum_Standard_A4             = 21,
	pfenum_Standard_MAX            = 22
};


// Enum PlayFab.EContainerFlavor
enum class EContainerFlavor : uint8_t
{
	pfenum_ManagedWindowsServerCore = 0,
	pfenum_CustomLinux             = 1,
	pfenum_ManagedWindowsServerCorePreview = 2,
	pfenum_MAX                     = 3
};


// Enum PlayFab.EAzureRegion
enum class EAzureRegion : uint8_t
{
	pfenum_AustraliaEast           = 0,
	pfenum_AustraliaSoutheast      = 1,
	pfenum_BrazilSouth             = 2,
	pfenum_CentralUs               = 3,
	pfenum_EastAsia                = 4,
	pfenum_EastUs                  = 5,
	pfenum_EastUs2                 = 6,
	pfenum_JapanEast               = 7,
	pfenum_JapanWest               = 8,
	pfenum_NorthCentralUs          = 9,
	pfenum_NorthEurope             = 10,
	pfenum_SouthCentralUs          = 11,
	pfenum_SoutheastAsia           = 12,
	pfenum_WestEurope              = 13,
	pfenum_WestUs                  = 14,
	pfenum_ChinaEast2              = 15,
	pfenum_ChinaNorth2             = 16,
	pfenum_SouthAfricaNorth        = 17,
	pfenum_MAX                     = 18
};


// Enum PlayFab.ETitleMultiplayerServerEnabledStatus
enum class ETitleMultiplayerServerEnabledStatus : uint8_t
{
	pfenum_Initializing            = 0,
	pfenum_Enabled                 = 1,
	pfenum_Disabled                = 2,
	pfenum_MAX                     = 3
};


// Enum PlayFab.ECancellationReason
enum class ECancellationReason : uint8_t
{
	pfenum_Requested               = 0,
	pfenum_Internal                = 1,
	pfenum_Timeout                 = 2,
	pfenum_MAX                     = 3
};


// Enum PlayFab.EPlayerConnectionState
enum class EPlayerConnectionState : uint8_t
{
	pfenum_Unassigned              = 0,
	pfenum_Connecting              = 1,
	pfenum_Participating           = 2,
	pfenum_Participated            = 3,
	pfenum_MAX                     = 4
};


// Enum PlayFab.EGameInstanceState
enum class EGameInstanceState : uint8_t
{
	pfenum_Open                    = 0,
	pfenum_Closed                  = 1,
	pfenum_MAX                     = 2
};


// Enum PlayFab.EProtocolType
enum class EProtocolType : uint8_t
{
	pfenum_TCP                     = 0,
	pfenum_UDP                     = 1,
	pfenum_MAX                     = 2
};


// Enum PlayFab.EAzureVmFamily
enum class EAzureVmFamily : uint8_t
{
	pfenum_A                       = 0,
	pfenum_Av2                     = 1,
	pfenum_Dv2                     = 2,
	pfenum_F                       = 3,
	pfenum_Fsv2                    = 4,
	pfenum_MAX                     = 5
};


// Enum PlayFab.EUserOrigination
enum class EUserOrigination : uint8_t
{
	pfenum_Organic                 = 0,
	pfenum_Steam                   = 1,
	pfenum_Google                  = 2,
	pfenum_Amazon                  = 3,
	pfenum_Facebook                = 4,
	pfenum_Kongregate              = 5,
	pfenum_GamersFirst             = 6,
	pfenum_Unknown                 = 7,
	pfenum_IOS                     = 8,
	pfenum_LoadTest                = 9,
	pfenum_Android                 = 10,
	pfenum_PSN                     = 11,
	pfenum_GameCenter              = 12,
	pfenum_CustomId                = 13,
	pfenum_XboxLive                = 14,
	pfenum_Parse                   = 15,
	pfenum_Twitch                  = 16,
	pfenum_WindowsHello            = 17,
	pfenum_ServerCustomId          = 18,
	pfenum_NintendoSwitchDeviceId  = 19,
	pfenum_FacebookInstantGamesId  = 20,
	pfenum_OpenIdConnect           = 21,
	pfenum_MAX                     = 22
};


// Enum PlayFab.ETitleActivationStatus
enum class ETitleActivationStatus : uint8_t
{
	pfenum_None                    = 0,
	pfenum_ActivatedTitleKey       = 1,
	pfenum_PendingSteam            = 2,
	pfenum_ActivatedSteam          = 3,
	pfenum_RevokedSteam            = 4,
	pfenum_MAX                     = 5
};


// Enum PlayFab.ESubscriptionProviderStatus
enum class ESubscriptionProviderStatus : uint8_t
{
	pfenum_NoError                 = 0,
	pfenum_Cancelled               = 1,
	pfenum_UnknownError            = 2,
	pfenum_BillingError            = 3,
	pfenum_ProductUnavailable      = 4,
	pfenum_CustomerDidNotAcceptPriceChange = 5,
	pfenum_FreeTrial               = 6,
	pfenum_PaymentPending          = 7,
	pfenum_MAX                     = 8
};


// Enum PlayFab.EStatisticVersionStatus
enum class EStatisticVersionStatus : uint8_t
{
	pfenum_Active                  = 0,
	pfenum_SnapshotPending         = 1,
	pfenum_Snapshot                = 2,
	pfenum_ArchivalPending         = 3,
	pfenum_Archived                = 4,
	pfenum_MAX                     = 5
};


// Enum PlayFab.EStatisticVersionArchivalStatus
enum class EStatisticVersionArchivalStatus : uint8_t
{
	pfenum_NotScheduled            = 0,
	pfenum_Scheduled               = 1,
	pfenum_Queued                  = 2,
	pfenum_InProgress              = 3,
	pfenum_Complete                = 4,
	pfenum_MAX                     = 5
};


// Enum PlayFab.EResultTableNodeType
enum class EResultTableNodeType : uint8_t
{
	pfenum_ItemId                  = 0,
	pfenum_TableId                 = 1,
	pfenum_MAX                     = 2
};


// Enum PlayFab.EPushNotificationPlatform
enum class EPushNotificationPlatform : uint8_t
{
	pfenum_ApplePushNotificationService = 0,
	pfenum_GoogleCloudMessaging    = 1,
	pfenum_MAX                     = 2
};


// Enum PlayFab.ELoginIdentityProvider
enum class ELoginIdentityProvider : uint8_t
{
	pfenum_Unknown                 = 0,
	pfenum_PlayFab                 = 1,
	pfenum_Custom                  = 2,
	pfenum_GameCenter              = 3,
	pfenum_GooglePlay              = 4,
	pfenum_Steam                   = 5,
	pfenum_XBoxLive                = 6,
	pfenum_PSN                     = 7,
	pfenum_Kongregate              = 8,
	pfenum_Facebook                = 9,
	pfenum_IOSDevice               = 10,
	pfenum_AndroidDevice           = 11,
	pfenum_Twitch                  = 12,
	pfenum_WindowsHello            = 13,
	pfenum_GameServer              = 14,
	pfenum_CustomServer            = 15,
	pfenum_NintendoSwitch          = 16,
	pfenum_FacebookInstantGames    = 17,
	pfenum_OpenIdConnect           = 18,
	pfenum_MAX                     = 19
};


// Enum PlayFab.EEmailVerificationStatus
enum class EEmailVerificationStatus : uint8_t
{
	pfenum_Unverified              = 0,
	pfenum_Pending                 = 1,
	pfenum_Confirmed               = 2,
	pfenum_MAX                     = 3
};


// Enum PlayFab.EEffectType
enum class EEffectType : uint8_t
{
	pfenum_Allow                   = 0,
	pfenum_Deny                    = 1,
	pfenum_MAX                     = 2
};


// Enum PlayFab.ECurrency
enum class ECurrency : uint8_t
{
	pfenum_AED                     = 0,
	pfenum_AFN                     = 1,
	pfenum_ALL                     = 2,
	pfenum_AMD                     = 3,
	pfenum_ANG                     = 4,
	pfenum_AOA                     = 5,
	pfenum_ARS                     = 6,
	pfenum_AUD                     = 7,
	pfenum_AWG                     = 8,
	pfenum_AZN                     = 9,
	pfenum_BAM                     = 10,
	pfenum_BBD                     = 11,
	pfenum_BDT                     = 12,
	pfenum_BGN                     = 13,
	pfenum_BHD                     = 14,
	pfenum_BIF                     = 15,
	pfenum_BMD                     = 16,
	pfenum_BND                     = 17,
	pfenum_BOB                     = 18,
	pfenum_BRL                     = 19,
	pfenum_BSD                     = 20,
	pfenum_BTN                     = 21,
	pfenum_BWP                     = 22,
	pfenum_BYR                     = 23,
	pfenum_BZD                     = 24,
	pfenum_CAD                     = 25,
	pfenum_CDF                     = 26,
	pfenum_CHF                     = 27,
	pfenum_CLP                     = 28,
	pfenum_CNY                     = 29,
	pfenum_COP                     = 30,
	pfenum_CRC                     = 31,
	pfenum_CUC                     = 32,
	pfenum_CUP                     = 33,
	pfenum_CVE                     = 34,
	pfenum_CZK                     = 35,
	pfenum_DJF                     = 36,
	pfenum_DKK                     = 37,
	pfenum_DOP                     = 38,
	pfenum_DZD                     = 39,
	pfenum_EGP                     = 40,
	pfenum_ERN                     = 41,
	pfenum_ETB                     = 42,
	pfenum_EUR                     = 43,
	pfenum_FJD                     = 44,
	pfenum_FKP                     = 45,
	pfenum_GBP                     = 46,
	pfenum_GEL                     = 47,
	pfenum_GGP                     = 48,
	pfenum_GHS                     = 49,
	pfenum_GIP                     = 50,
	pfenum_GMD                     = 51,
	pfenum_GNF                     = 52,
	pfenum_GTQ                     = 53,
	pfenum_GYD                     = 54,
	pfenum_HKD                     = 55,
	pfenum_HNL                     = 56,
	pfenum_HRK                     = 57,
	pfenum_HTG                     = 58,
	pfenum_HUF                     = 59,
	pfenum_IDR                     = 60,
	pfenum_ILS                     = 61,
	pfenum_IMP                     = 62,
	pfenum_INR                     = 63,
	pfenum_IQD                     = 64,
	pfenum_IRR                     = 65,
	pfenum_ISK                     = 66,
	pfenum_JEP                     = 67,
	pfenum_JMD                     = 68,
	pfenum_JOD                     = 69,
	pfenum_JPY                     = 70,
	pfenum_KES                     = 71,
	pfenum_KGS                     = 72,
	pfenum_KHR                     = 73,
	pfenum_KMF                     = 74,
	pfenum_KPW                     = 75,
	pfenum_KRW                     = 76,
	pfenum_KWD                     = 77,
	pfenum_KYD                     = 78,
	pfenum_KZT                     = 79,
	pfenum_LAK                     = 80,
	pfenum_LBP                     = 81,
	pfenum_LKR                     = 82,
	pfenum_LRD                     = 83,
	pfenum_LSL                     = 84,
	pfenum_LYD                     = 85,
	pfenum_MAD                     = 86,
	pfenum_MDL                     = 87,
	pfenum_MGA                     = 88,
	pfenum_MKD                     = 89,
	pfenum_MMK                     = 90,
	pfenum_MNT                     = 91,
	pfenum_MOP                     = 92,
	pfenum_MRO                     = 93,
	pfenum_MUR                     = 94,
	pfenum_MVR                     = 95,
	pfenum_MWK                     = 96,
	pfenum_MXN                     = 97,
	pfenum_MYR                     = 98,
	pfenum_MZN                     = 99,
	pfenum_NAD                     = 100,
	pfenum_NGN                     = 101,
	pfenum_NIO                     = 102,
	pfenum_NOK                     = 103,
	pfenum_NPR                     = 104,
	pfenum_NZD                     = 105,
	pfenum_OMR                     = 106,
	pfenum_PAB                     = 107,
	pfenum_PEN                     = 108,
	pfenum_PGK                     = 109,
	pfenum_PHP                     = 110,
	pfenum_PKR                     = 111,
	pfenum_PLN                     = 112,
	pfenum_PYG                     = 113,
	pfenum_QAR                     = 114,
	pfenum_RON                     = 115,
	pfenum_RSD                     = 116,
	pfenum_RUB                     = 117,
	pfenum_RWF                     = 118,
	pfenum_SAR                     = 119,
	pfenum_SBD                     = 120,
	pfenum_SCR                     = 121,
	pfenum_SDG                     = 122,
	pfenum_SEK                     = 123,
	pfenum_SGD                     = 124,
	pfenum_SHP                     = 125,
	pfenum_SLL                     = 126,
	pfenum_SOS                     = 127,
	pfenum_SPL                     = 128,
	pfenum_SRD                     = 129,
	pfenum_STD                     = 130,
	pfenum_SVC                     = 131,
	pfenum_SYP                     = 132,
	pfenum_SZL                     = 133,
	pfenum_THB                     = 134,
	pfenum_TJS                     = 135,
	pfenum_TMT                     = 136,
	pfenum_TND                     = 137,
	pfenum_TOP                     = 138,
	pfenum_TRY                     = 139,
	pfenum_TTD                     = 140,
	pfenum_TVD                     = 141,
	pfenum_TWD                     = 142,
	pfenum_TZS                     = 143,
	pfenum_UAH                     = 144,
	pfenum_UGX                     = 145,
	pfenum_USD                     = 146,
	pfenum_UYU                     = 147,
	pfenum_UZS                     = 148,
	pfenum_VEF                     = 149,
	pfenum_VND                     = 150,
	pfenum_VUV                     = 151,
	pfenum_WST                     = 152,
	pfenum_XAF                     = 153,
	pfenum_XCD                     = 154,
	pfenum_XDR                     = 155,
	pfenum_XOF                     = 156,
	pfenum_XPF                     = 157,
	pfenum_YER                     = 158,
	pfenum_ZAR                     = 159,
	pfenum_ZMW                     = 160,
	pfenum_ZWD                     = 161,
	pfenum_MAX                     = 162
};


// Enum PlayFab.ECountryCode
enum class ECountryCode : uint8_t
{
	pfenum_AF                      = 0,
	pfenum_AX                      = 1,
	pfenum_AL                      = 2,
	pfenum_DZ                      = 3,
	pfenum_AS                      = 4,
	pfenum_AD                      = 5,
	pfenum_AO                      = 6,
	pfenum_AI                      = 7,
	pfenum_AQ                      = 8,
	pfenum_AG                      = 9,
	pfenum_AR                      = 10,
	pfenum_AM                      = 11,
	pfenum_AW                      = 12,
	pfenum_AU                      = 13,
	pfenum_AT                      = 14,
	pfenum_AZ                      = 15,
	pfenum_BS                      = 16,
	pfenum_BH                      = 17,
	pfenum_BD                      = 18,
	pfenum_BB                      = 19,
	pfenum_BY                      = 20,
	pfenum_BE                      = 21,
	pfenum_BZ                      = 22,
	pfenum_BJ                      = 23,
	pfenum_BM                      = 24,
	pfenum_BT                      = 25,
	pfenum_BO                      = 26,
	pfenum_BQ                      = 27,
	pfenum_BA                      = 28,
	pfenum_BW                      = 29,
	pfenum_BV                      = 30,
	pfenum_BR                      = 31,
	pfenum_IO                      = 32,
	pfenum_BN                      = 33,
	pfenum_BG                      = 34,
	pfenum_BF                      = 35,
	pfenum_BI                      = 36,
	pfenum_KH                      = 37,
	pfenum_CM                      = 38,
	pfenum_CA                      = 39,
	pfenum_CV                      = 40,
	pfenum_KY                      = 41,
	pfenum_CF                      = 42,
	pfenum_TD                      = 43,
	pfenum_CL                      = 44,
	pfenum_CN                      = 45,
	pfenum_CX                      = 46,
	pfenum_CC                      = 47,
	pfenum_CO                      = 48,
	pfenum_KM                      = 49,
	pfenum_CG                      = 50,
	pfenum_CD                      = 51,
	pfenum_CK                      = 52,
	pfenum_CR                      = 53,
	pfenum_CI                      = 54,
	pfenum_HR                      = 55,
	pfenum_CU                      = 56,
	pfenum_CW                      = 57,
	pfenum_CY                      = 58,
	pfenum_CZ                      = 59,
	pfenum_DK                      = 60,
	pfenum_DJ                      = 61,
	pfenum_DM                      = 62,
	pfenum_DO                      = 63,
	pfenum_EC                      = 64,
	pfenum_EG                      = 65,
	pfenum_SV                      = 66,
	pfenum_GQ                      = 67,
	pfenum_ER                      = 68,
	pfenum_EE                      = 69,
	pfenum_ET                      = 70,
	pfenum_FK                      = 71,
	pfenum_FO                      = 72,
	pfenum_FJ                      = 73,
	pfenum_FI                      = 74,
	pfenum_FR                      = 75,
	pfenum_GF                      = 76,
	pfenum_PF                      = 77,
	pfenum_TF                      = 78,
	pfenum_GA                      = 79,
	pfenum_GM                      = 80,
	pfenum_GE                      = 81,
	pfenum_DE                      = 82,
	pfenum_GH                      = 83,
	pfenum_GI                      = 84,
	pfenum_GR                      = 85,
	pfenum_GL                      = 86,
	pfenum_GD                      = 87,
	pfenum_GP                      = 88,
	pfenum_GU                      = 89,
	pfenum_GT                      = 90,
	pfenum_GG                      = 91,
	pfenum_GN                      = 92,
	pfenum_GW                      = 93,
	pfenum_GY                      = 94,
	pfenum_HT                      = 95,
	pfenum_HM                      = 96,
	pfenum_VA                      = 97,
	pfenum_HN                      = 98,
	pfenum_HK                      = 99,
	pfenum_HU                      = 100,
	pfenum_IS                      = 101,
	pfenum_IN                      = 102,
	pfenum_ID                      = 103,
	pfenum_IR                      = 104,
	pfenum_IQ                      = 105,
	pfenum_IE                      = 106,
	pfenum_IM                      = 107,
	pfenum_IL                      = 108,
	pfenum_IT                      = 109,
	pfenum_JM                      = 110,
	pfenum_JP                      = 111,
	pfenum_JE                      = 112,
	pfenum_JO                      = 113,
	pfenum_KZ                      = 114,
	pfenum_KE                      = 115,
	pfenum_KI                      = 116,
	pfenum_KP                      = 117,
	pfenum_KR                      = 118,
	pfenum_KW                      = 119,
	pfenum_KG                      = 120,
	pfenum_LA                      = 121,
	pfenum_LV                      = 122,
	pfenum_LB                      = 123,
	pfenum_LS                      = 124,
	pfenum_LR                      = 125,
	pfenum_LY                      = 126,
	pfenum_LI                      = 127,
	pfenum_LT                      = 128,
	pfenum_LU                      = 129,
	pfenum_MO                      = 130,
	pfenum_MK                      = 131,
	pfenum_MG                      = 132,
	pfenum_MW                      = 133,
	pfenum_MY                      = 134,
	pfenum_MV                      = 135,
	pfenum_ML                      = 136,
	pfenum_MT                      = 137,
	pfenum_MH                      = 138,
	pfenum_MQ                      = 139,
	pfenum_MR                      = 140,
	pfenum_MU                      = 141,
	pfenum_YT                      = 142,
	pfenum_MX                      = 143,
	pfenum_FM                      = 144,
	pfenum_MD                      = 145,
	pfenum_MC                      = 146,
	pfenum_MN                      = 147,
	pfenum_ME                      = 148,
	pfenum_MS                      = 149,
	pfenum_MA                      = 150,
	pfenum_MZ                      = 151,
	pfenum_MM                      = 152,
	pfenum_NA                      = 153,
	pfenum_NR                      = 154,
	pfenum_NP                      = 155,
	pfenum_NL                      = 156,
	pfenum_NC                      = 157,
	pfenum_NZ                      = 158,
	pfenum_NI                      = 159,
	pfenum_NE                      = 160,
	pfenum_NG                      = 161,
	pfenum_NU                      = 162,
	pfenum_NF                      = 163,
	pfenum_MP                      = 164,
	pfenum_NO                      = 165,
	pfenum_OM                      = 166,
	pfenum_PK                      = 167,
	pfenum_PW                      = 168,
	pfenum_PS                      = 169,
	pfenum_PA                      = 170,
	pfenum_PG                      = 171,
	pfenum_PY                      = 172,
	pfenum_PE                      = 173,
	pfenum_PH                      = 174,
	pfenum_PN                      = 175,
	pfenum_PL                      = 176,
	pfenum_PT                      = 177,
	pfenum_PR                      = 178,
	pfenum_QA                      = 179,
	pfenum_RE                      = 180,
	pfenum_RO                      = 181,
	pfenum_RU                      = 182,
	pfenum_RW                      = 183,
	pfenum_BL                      = 184,
	pfenum_SH                      = 185,
	pfenum_KN                      = 186,
	pfenum_LC                      = 187,
	pfenum_MF                      = 188,
	pfenum_PM                      = 189,
	pfenum_VC                      = 190,
	pfenum_WS                      = 191,
	pfenum_SM                      = 192,
	pfenum_ST                      = 193,
	pfenum_SA                      = 194,
	pfenum_SN                      = 195,
	pfenum_RS                      = 196,
	pfenum_SC                      = 197,
	pfenum_SL                      = 198,
	pfenum_SG                      = 199,
	pfenum_SX                      = 200,
	pfenum_SK                      = 201,
	pfenum_SI                      = 202,
	pfenum_SB                      = 203,
	pfenum_SO                      = 204,
	pfenum_ZA                      = 205,
	pfenum_GS                      = 206,
	pfenum_SS                      = 207,
	pfenum_ES                      = 208,
	pfenum_LK                      = 209,
	pfenum_SD                      = 210,
	pfenum_SR                      = 211,
	pfenum_SJ                      = 212,
	pfenum_SZ                      = 213,
	pfenum_SE                      = 214,
	pfenum_CH                      = 215,
	pfenum_SY                      = 216,
	pfenum_TW                      = 217,
	pfenum_TJ                      = 218,
	pfenum_TZ                      = 219,
	pfenum_TH                      = 220,
	pfenum_TL                      = 221,
	pfenum_TG                      = 222,
	pfenum_TK                      = 223,
	pfenum_TO                      = 224,
	pfenum_TT                      = 225,
	pfenum_TN                      = 226,
	pfenum_TR                      = 227,
	pfenum_TM                      = 228,
	pfenum_TC                      = 229,
	pfenum_TV                      = 230,
	pfenum_UG                      = 231,
	pfenum_UA                      = 232,
	pfenum_AE                      = 233,
	pfenum_GB                      = 234,
	pfenum_US                      = 235,
	pfenum_UM                      = 236,
	pfenum_UY                      = 237,
	pfenum_UZ                      = 238,
	pfenum_VU                      = 239,
	pfenum_VE                      = 240,
	pfenum_VN                      = 241,
	pfenum_VG                      = 242,
	pfenum_VI                      = 243,
	pfenum_WF                      = 244,
	pfenum_EH                      = 245,
	pfenum_YE                      = 246,
	pfenum_ZM                      = 247,
	pfenum_ZW                      = 248,
	pfenum_MAX                     = 249
};


// Enum PlayFab.EContinentCode
enum class EContinentCode : uint8_t
{
	pfenum_AF                      = 0,
	pfenum_AN                      = 1,
	pfenum_AS                      = 2,
	pfenum_EU                      = 3,
	pfenum_NA                      = 4,
	pfenum_OC                      = 5,
	pfenum_SA                      = 6,
	pfenum_MAX                     = 7
};


// Enum PlayFab.EConditionals
enum class EConditionals : uint8_t
{
	pfenum_Any                     = 0,
	pfenum_True                    = 1,
	pfenum_False                   = 2,
	pfenum_MAX                     = 3
};


// Enum PlayFab.EPFJson
enum class EPFJson : uint8_t
{
	None                           = 0,
	Null                           = 1,
	String                         = 2,
	Number                         = 3,
	Boolean                        = 4,
	Array                          = 5,
	Object                         = 6,
	EPFJson_MAX                    = 7
};



//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// ScriptStruct PlayFab.PlayFabRequestCommon
// 0x0008
struct FPlayFabRequestCommon
{
	class UPlayFabAuthenticationContext*               AuthenticationContext;                                    // 0x0000(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct PlayFab.AdminUpdateUserTitleDisplayNameRequest
// 0x0020 (0x0028 - 0x0008)
struct FAdminUpdateUserTitleDisplayNameRequest : public FPlayFabRequestCommon
{
	struct FString                                     DisplayName;                                              // 0x0008(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     PlayFabId;                                                // 0x0018(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
};

// ScriptStruct PlayFab.AdminUpdateUserDataRequest
// 0x0030 (0x0038 - 0x0008)
struct FAdminUpdateUserDataRequest : public FPlayFabRequestCommon
{
	class UPlayFabJsonObject*                          Data;                                                     // 0x0008(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     KeysToRemove;                                             // 0x0010(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	EUserDataPermission                                Permission;                                               // 0x0020(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0021(0x0007) MISSED OFFSET
	struct FString                                     PlayFabId;                                                // 0x0028(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
};

// ScriptStruct PlayFab.AdminUpdateUserInternalDataRequest
// 0x0028 (0x0030 - 0x0008)
struct FAdminUpdateUserInternalDataRequest : public FPlayFabRequestCommon
{
	class UPlayFabJsonObject*                          Data;                                                     // 0x0008(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     KeysToRemove;                                             // 0x0010(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     PlayFabId;                                                // 0x0020(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
};

// ScriptStruct PlayFab.AdminUpdateTaskRequest
// 0x0050 (0x0058 - 0x0008)
struct FAdminUpdateTaskRequest : public FPlayFabRequestCommon
{
	struct FString                                     Description;                                              // 0x0008(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	class UPlayFabJsonObject*                          Identifier;                                               // 0x0018(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               IsActive;                                                 // 0x0020(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0021(0x0007) MISSED OFFSET
	struct FString                                     Name;                                                     // 0x0028(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	class UPlayFabJsonObject*                          Parameter;                                                // 0x0038(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     Schedule;                                                 // 0x0040(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	EScheduledTaskType                                 Type;                                                     // 0x0050(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x7];                                       // 0x0051(0x0007) MISSED OFFSET
};

// ScriptStruct PlayFab.AdminUpdateStoreItemsRequest
// 0x0038 (0x0040 - 0x0008)
struct FAdminUpdateStoreItemsRequest : public FPlayFabRequestCommon
{
	struct FString                                     CatalogVersion;                                           // 0x0008(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	class UPlayFabJsonObject*                          MarketingData;                                            // 0x0018(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	TArray<class UPlayFabJsonObject*>                  Store;                                                    // 0x0020(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     StoreId;                                                  // 0x0030(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
};

// ScriptStruct PlayFab.AdminUpdateRandomResultTablesRequest
// 0x0020 (0x0028 - 0x0008)
struct FAdminUpdateRandomResultTablesRequest : public FPlayFabRequestCommon
{
	struct FString                                     CatalogVersion;                                           // 0x0008(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	TArray<class UPlayFabJsonObject*>                  Tables;                                                   // 0x0018(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
};

// ScriptStruct PlayFab.AdminUpdatePolicyRequest
// 0x0028 (0x0030 - 0x0008)
struct FAdminUpdatePolicyRequest : public FPlayFabRequestCommon
{
	bool                                               OverwritePolicy;                                          // 0x0008(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0009(0x0007) MISSED OFFSET
	struct FString                                     PolicyName;                                               // 0x0010(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	TArray<class UPlayFabJsonObject*>                  Statements;                                               // 0x0020(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
};

// ScriptStruct PlayFab.AdminUpdatePlayerStatisticDefinitionRequest
// 0x0020 (0x0028 - 0x0008)
struct FAdminUpdatePlayerStatisticDefinitionRequest : public FPlayFabRequestCommon
{
	EStatisticAggregationMethod                        AggregationMethod;                                        // 0x0008(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0009(0x0007) MISSED OFFSET
	struct FString                                     StatisticName;                                            // 0x0010(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	EStatisticResetIntervalOption                      VersionChangeInterval;                                    // 0x0020(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x7];                                       // 0x0021(0x0007) MISSED OFFSET
};

// ScriptStruct PlayFab.AdminUpdatePlayerSharedSecretRequest
// 0x0028 (0x0030 - 0x0008)
struct FAdminUpdatePlayerSharedSecretRequest : public FPlayFabRequestCommon
{
	bool                                               Disabled;                                                 // 0x0008(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0009(0x0007) MISSED OFFSET
	struct FString                                     FriendlyName;                                             // 0x0010(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     SecretKey;                                                // 0x0020(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
};

// ScriptStruct PlayFab.AdminUpdateOpenIdConnectionRequest
// 0x0048 (0x0050 - 0x0008)
struct FAdminUpdateOpenIdConnectionRequest : public FPlayFabRequestCommon
{
	struct FString                                     ClientId;                                                 // 0x0008(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     ClientSecret;                                             // 0x0018(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     ConnectionId;                                             // 0x0028(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     IssuerDiscoveryUrl;                                       // 0x0038(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	class UPlayFabJsonObject*                          IssuerInformation;                                        // 0x0048(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct PlayFab.AdminUpdateCloudScriptRequest
// 0x0028 (0x0030 - 0x0008)
struct FAdminUpdateCloudScriptRequest : public FPlayFabRequestCommon
{
	struct FString                                     DeveloperPlayFabId;                                       // 0x0008(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	TArray<class UPlayFabJsonObject*>                  Files;                                                    // 0x0018(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	bool                                               Publish;                                                  // 0x0028(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0029(0x0007) MISSED OFFSET
};

// ScriptStruct PlayFab.AdminUpdateCatalogItemsRequest
// 0x0028 (0x0030 - 0x0008)
struct FAdminUpdateCatalogItemsRequest : public FPlayFabRequestCommon
{
	TArray<class UPlayFabJsonObject*>                  Catalog;                                                  // 0x0008(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     CatalogVersion;                                           // 0x0018(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	bool                                               SetAsDefaultCatalog;                                      // 0x0028(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0029(0x0007) MISSED OFFSET
};

// ScriptStruct PlayFab.AdminUpdateBansRequest
// 0x0010 (0x0018 - 0x0008)
struct FAdminUpdateBansRequest : public FPlayFabRequestCommon
{
	TArray<class UPlayFabJsonObject*>                  Bans;                                                     // 0x0008(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
};

// ScriptStruct PlayFab.AdminSubtractUserVirtualCurrencyRequest
// 0x0028 (0x0030 - 0x0008)
struct FAdminSubtractUserVirtualCurrencyRequest : public FPlayFabRequestCommon
{
	int                                                Amount;                                                   // 0x0008(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x000C(0x0004) MISSED OFFSET
	struct FString                                     PlayFabId;                                                // 0x0010(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     VirtualCurrency;                                          // 0x0020(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
};

// ScriptStruct PlayFab.AdminSetupPushNotificationRequest
// 0x0038 (0x0040 - 0x0008)
struct FAdminSetupPushNotificationRequest : public FPlayFabRequestCommon
{
	struct FString                                     Credential;                                               // 0x0008(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     Key;                                                      // 0x0018(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     Name;                                                     // 0x0028(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	bool                                               OverwriteOldARN;                                          // 0x0038(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	EPushSetupPlatform                                 Platform;                                                 // 0x0039(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x6];                                       // 0x003A(0x0006) MISSED OFFSET
};

// ScriptStruct PlayFab.AdminSetTitleDataRequest
// 0x0020 (0x0028 - 0x0008)
struct FAdminSetTitleDataRequest : public FPlayFabRequestCommon
{
	struct FString                                     Key;                                                      // 0x0008(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     Value;                                                    // 0x0018(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
};

// ScriptStruct PlayFab.AdminSetPublisherDataRequest
// 0x0020 (0x0028 - 0x0008)
struct FAdminSetPublisherDataRequest : public FPlayFabRequestCommon
{
	struct FString                                     Key;                                                      // 0x0008(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     Value;                                                    // 0x0018(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
};

// ScriptStruct PlayFab.AdminSetPublishedRevisionRequest
// 0x0008 (0x0010 - 0x0008)
struct FAdminSetPublishedRevisionRequest : public FPlayFabRequestCommon
{
	int                                                Revision;                                                 // 0x0008(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                Version;                                                  // 0x000C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct PlayFab.AdminSetPlayerSecretRequest
// 0x0020 (0x0028 - 0x0008)
struct FAdminSetPlayerSecretRequest : public FPlayFabRequestCommon
{
	struct FString                                     PlayerSecret;                                             // 0x0008(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     PlayFabId;                                                // 0x0018(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
};

// ScriptStruct PlayFab.AdminSendAccountRecoveryEmailRequest
// 0x0020 (0x0028 - 0x0008)
struct FAdminSendAccountRecoveryEmailRequest : public FPlayFabRequestCommon
{
	struct FString                                     Email;                                                    // 0x0008(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     EmailTemplateId;                                          // 0x0018(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
};

// ScriptStruct PlayFab.AdminRunTaskRequest
// 0x0008 (0x0010 - 0x0008)
struct FAdminRunTaskRequest : public FPlayFabRequestCommon
{
	class UPlayFabJsonObject*                          Identifier;                                               // 0x0008(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct PlayFab.AdminRevokeInventoryItemsRequest
// 0x0010 (0x0018 - 0x0008)
struct FAdminRevokeInventoryItemsRequest : public FPlayFabRequestCommon
{
	TArray<class UPlayFabJsonObject*>                  Items;                                                    // 0x0008(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
};

// ScriptStruct PlayFab.AdminRevokeInventoryItemRequest
// 0x0030 (0x0038 - 0x0008)
struct FAdminRevokeInventoryItemRequest : public FPlayFabRequestCommon
{
	struct FString                                     CharacterId;                                              // 0x0008(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     ItemInstanceId;                                           // 0x0018(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     PlayFabId;                                                // 0x0028(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
};

// ScriptStruct PlayFab.AdminRevokeBansRequest
// 0x0010 (0x0018 - 0x0008)
struct FAdminRevokeBansRequest : public FPlayFabRequestCommon
{
	struct FString                                     BanIds;                                                   // 0x0008(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
};

// ScriptStruct PlayFab.AdminRevokeAllBansForUserRequest
// 0x0010 (0x0018 - 0x0008)
struct FAdminRevokeAllBansForUserRequest : public FPlayFabRequestCommon
{
	struct FString                                     PlayFabId;                                                // 0x0008(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
};

// ScriptStruct PlayFab.AdminResolvePurchaseDisputeRequest
// 0x0038 (0x0040 - 0x0008)
struct FAdminResolvePurchaseDisputeRequest : public FPlayFabRequestCommon
{
	struct FString                                     OrderId;                                                  // 0x0008(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	EResolutionOutcome                                 Outcome;                                                  // 0x0018(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0019(0x0007) MISSED OFFSET
	struct FString                                     PlayFabId;                                                // 0x0020(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     Reason;                                                   // 0x0030(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
};

// ScriptStruct PlayFab.AdminResetUserStatisticsRequest
// 0x0010 (0x0018 - 0x0008)
struct FAdminResetUserStatisticsRequest : public FPlayFabRequestCommon
{
	struct FString                                     PlayFabId;                                                // 0x0008(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
};

// ScriptStruct PlayFab.AdminResetPasswordRequest
// 0x0020 (0x0028 - 0x0008)
struct FAdminResetPasswordRequest : public FPlayFabRequestCommon
{
	struct FString                                     Password;                                                 // 0x0008(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     Token;                                                    // 0x0018(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
};

// ScriptStruct PlayFab.AdminResetCharacterStatisticsRequest
// 0x0020 (0x0028 - 0x0008)
struct FAdminResetCharacterStatisticsRequest : public FPlayFabRequestCommon
{
	struct FString                                     CharacterId;                                              // 0x0008(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     PlayFabId;                                                // 0x0018(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
};

// ScriptStruct PlayFab.AdminRemoveVirtualCurrencyTypesRequest
// 0x0010 (0x0018 - 0x0008)
struct FAdminRemoveVirtualCurrencyTypesRequest : public FPlayFabRequestCommon
{
	TArray<class UPlayFabJsonObject*>                  VirtualCurrencies;                                        // 0x0008(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
};

// ScriptStruct PlayFab.AdminRemoveServerBuildRequest
// 0x0010 (0x0018 - 0x0008)
struct FAdminRemoveServerBuildRequest : public FPlayFabRequestCommon
{
	struct FString                                     BuildId;                                                  // 0x0008(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
};

// ScriptStruct PlayFab.AdminRemovePlayerTagRequest
// 0x0020 (0x0028 - 0x0008)
struct FAdminRemovePlayerTagRequest : public FPlayFabRequestCommon
{
	struct FString                                     PlayFabId;                                                // 0x0008(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     TagName;                                                  // 0x0018(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
};

// ScriptStruct PlayFab.AdminRefundPurchaseRequest
// 0x0030 (0x0038 - 0x0008)
struct FAdminRefundPurchaseRequest : public FPlayFabRequestCommon
{
	struct FString                                     OrderId;                                                  // 0x0008(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     PlayFabId;                                                // 0x0018(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     Reason;                                                   // 0x0028(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
};

// ScriptStruct PlayFab.AdminModifyServerBuildRequest
// 0x0068 (0x0070 - 0x0008)
struct FAdminModifyServerBuildRequest : public FPlayFabRequestCommon
{
	struct FString                                     ActiveRegions;                                            // 0x0008(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     BuildId;                                                  // 0x0018(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     CommandLineTemplate;                                      // 0x0028(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     Comment;                                                  // 0x0038(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     ExecutablePath;                                           // 0x0048(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                MaxGamesPerHost;                                          // 0x0058(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                MinFreeGameSlots;                                         // 0x005C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     Timestamp;                                                // 0x0060(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
};

// ScriptStruct PlayFab.AdminModifyMatchmakerGameModesRequest
// 0x0020 (0x0028 - 0x0008)
struct FAdminModifyMatchmakerGameModesRequest : public FPlayFabRequestCommon
{
	struct FString                                     BuildVersion;                                             // 0x0008(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	TArray<class UPlayFabJsonObject*>                  GameModes;                                                // 0x0018(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
};

// ScriptStruct PlayFab.AdminListVirtualCurrencyTypesRequest
// 0x0000 (0x0008 - 0x0008)
struct FAdminListVirtualCurrencyTypesRequest : public FPlayFabRequestCommon
{

};

// ScriptStruct PlayFab.AdminListBuildsRequest
// 0x0000 (0x0008 - 0x0008)
struct FAdminListBuildsRequest : public FPlayFabRequestCommon
{

};

// ScriptStruct PlayFab.AdminListOpenIdConnectionRequest
// 0x0000 (0x0008 - 0x0008)
struct FAdminListOpenIdConnectionRequest : public FPlayFabRequestCommon
{

};

// ScriptStruct PlayFab.AdminIncrementPlayerStatisticVersionRequest
// 0x0010 (0x0018 - 0x0008)
struct FAdminIncrementPlayerStatisticVersionRequest : public FPlayFabRequestCommon
{
	struct FString                                     StatisticName;                                            // 0x0008(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
};

// ScriptStruct PlayFab.AdminIncrementLimitedEditionItemAvailabilityRequest
// 0x0028 (0x0030 - 0x0008)
struct FAdminIncrementLimitedEditionItemAvailabilityRequest : public FPlayFabRequestCommon
{
	int                                                Amount;                                                   // 0x0008(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x000C(0x0004) MISSED OFFSET
	struct FString                                     CatalogVersion;                                           // 0x0010(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     ItemId;                                                   // 0x0020(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
};

// ScriptStruct PlayFab.PlayFabError
// 0x0038
struct FPlayFabError
{
	bool                                               HasError;                                                 // 0x0000(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0001(0x0003) MISSED OFFSET
	int                                                ErrorCode;                                                // 0x0004(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     ErrorName;                                                // 0x0008(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     ErrorMessage;                                             // 0x0018(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     ErrorDetails;                                             // 0x0028(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
};

// ScriptStruct PlayFab.PlayFabBaseModel
// 0x0040
struct FPlayFabBaseModel
{
	struct FPlayFabError                               responseError;                                            // 0x0000(0x0038) (Edit, BlueprintVisible)
	class UPlayFabJsonObject*                          ResponseData;                                             // 0x0038(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct PlayFab.AdminGrantItemsToUsersRequest
// 0x0020 (0x0028 - 0x0008)
struct FAdminGrantItemsToUsersRequest : public FPlayFabRequestCommon
{
	struct FString                                     CatalogVersion;                                           // 0x0008(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	TArray<class UPlayFabJsonObject*>                  ItemGrants;                                               // 0x0018(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
};

// ScriptStruct PlayFab.AdminGetUserDataRequest
// 0x0028 (0x0030 - 0x0008)
struct FAdminGetUserDataRequest : public FPlayFabRequestCommon
{
	int                                                IfChangedFromDataVersion;                                 // 0x0008(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x000C(0x0004) MISSED OFFSET
	struct FString                                     Keys;                                                     // 0x0010(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     PlayFabId;                                                // 0x0020(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
};

// ScriptStruct PlayFab.AdminGetUserInventoryRequest
// 0x0010 (0x0018 - 0x0008)
struct FAdminGetUserInventoryRequest : public FPlayFabRequestCommon
{
	struct FString                                     PlayFabId;                                                // 0x0008(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
};

