#pragma once

// Mordhau (Dumped by Hinnie) SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

namespace SDK
{
//---------------------------------------------------------------------------
//Classes
//---------------------------------------------------------------------------

// AnimBlueprintGeneratedClass AB_MordhauCharacterAnimation.AB_MordhauCharacterAnimation_C
// 0x29A18 (0x2A9A8 - 0x0F90)
class UAB_MordhauCharacterAnimation_C : public UMordhauAnimInstance
{
public:
	struct FPointerToUberGraphFrame                    UberGraphFrame;                                           // 0x0F90(0x0008) (Transient, DuplicateTransient)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_A60B09734595DA2E020EB5841472AC1E;// 0x0F98(0x0160)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_259922BA426E9973475ADFBDF9592F76;// 0x10F8(0x0160)
	unsigned char                                      UnknownData00[0x8];                                       // 0x1258(0x0008) MISSED OFFSET
	struct FAnimNode_TwoBoneIKOffset                   AnimGraphNode_TwoBoneIKOffset_B0478C7142E76B028D14D69CBC40E876;// 0x1260(0x02A0)
	struct FAnimNode_TwoBoneIKOffset                   AnimGraphNode_TwoBoneIKOffset_9AA48076499BD173C416268A212B67DE;// 0x1500(0x02A0)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_91954C1141778C931B7C2FA597420083;// 0x17A0(0x0160)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_05C999FE468632527F656485683CAB0A;// 0x1900(0x0160)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_E5B6C52249D1013941165CB5AFA680D0;// 0x1A60(0x0160)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_2AB089154FBBB4D2C98D4F893A5CDC71;// 0x1BC0(0x0160)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_42F987724CCDD245957470BECCC69B9F;// 0x1D20(0x0160)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_21488A174744F97BC528A0A18765C3FC;// 0x1E80(0x0160)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_B378CAAD4F9730BF6E760F8A96FBD185;// 0x1FE0(0x0160)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_93B578614283287CC5075C98C4B18DC5;// 0x2140(0x0160)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_B32D92A748E04B7E95C1819DCF6E06F9;// 0x22A0(0x0160)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_7E5004B74E7D8796E79AEF9F3070227F;// 0x2400(0x0160)
	struct FAnimNode_WeightShift                       AnimGraphNode_WeightShift_9E9BCC784AF7E2326BD8F6A7CD97C005;// 0x2560(0x0180)
	struct FAnimNode_CopyBone                          AnimGraphNode_CopyBone_2E5ACEDC4F3086212185EC8E6426CEAC;  // 0x26E0(0x0150)
	struct FAnimNode_CopyBone                          AnimGraphNode_CopyBone_E8888C8947C69124320AE6B66E75254C;  // 0x2830(0x0150)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_940C4CD5403C00C2BBB7628B5DD195DB;// 0x2980(0x0160)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_BAEDF3BC4406419CD82C97ABDDF5494C;// 0x2AE0(0x0160)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_E769108F46DFC9EB4C9DE3BAFB877542;// 0x2C40(0x0160)
	struct FAnimNode_FastUMAJiggle                     AnimGraphNode_FastUMAJiggle_CAA410244804F92E0A30979AD4F7F6F0;// 0x2DA0(0x0368)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_AB0E30F8435C4A26A43CC6AE0B8948D0;// 0x3108(0x0070)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_F0DDD4BE449E4936AFC284B6F3C044FD;// 0x3178(0x0118)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_04E9D1E743F142FFE9142DA25CDBB033;// 0x3290(0x0118)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_16EFBE93443A8C9D805A23BC3AD2FBB9;// 0x33A8(0x0118)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_23DD6E294594CE64656843AC999BAFE1;// 0x34C0(0x0160)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_9A4744A84546BD1501A93483BBB966C1;// 0x3620(0x0070)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_04F9E0FF4B8758B3B40BD380F9F44064;// 0x3690(0x0070)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_52A5D561478C1A2344435E94C1710E6B;// 0x3700(0x0070)
	struct FAnimNode_RotationMultiplier                AnimGraphNode_RotationMultiplier_AC92A41F4C64A2B8DD677F952F22BC9F;// 0x3770(0x0150)
	struct FAnimNode_RotationMultiplier                AnimGraphNode_RotationMultiplier_EAB88DEA45EBDE22EF2080AEC0BE6277;// 0x38C0(0x0150)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_1EED28C144FAF8389AAB77AB66B06F1B;// 0x3A10(0x0160)
	struct FAnimNode_MordhauSpringBone                 AnimGraphNode_MordhauSpringBone_E5760BAA4B65686E985266B7457E51E5;// 0x3B70(0x01A0)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_C68F77F7402FBBC67317D1ADEF4D854B;// 0x3D10(0x0160)
	struct FAnimNode_MordhauSpringBone                 AnimGraphNode_MordhauSpringBone_1AD800204163063EC75C11903E5C69EF;// 0x3E70(0x01A0)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_E9F3CDBC44CBFA2BD910A388B0AA487E;// 0x4010(0x0160)
	struct FAnimNode_Dismemberment                     AnimGraphNode_Dismemberment_69EEF9F348A003117A05DBB6AD550F49;// 0x4170(0x0128)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_DA7597344F977619A9FA0DAE39FA3941;// 0x4298(0x0160)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_783EF14543A8F664CB84B4A5F46BC3E1;// 0x43F8(0x0160)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_6CD74B34484AF5A4B03A8FA1678BD269;// 0x4558(0x0160)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_7E78CBE54D764A6017AC22B91C6CBD27;// 0x46B8(0x0160)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_910DC5E5405BF18F0BB1FA8C5AFD7F52;// 0x4818(0x0160)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_97560D8A486723518DE6E4933FF3AC2C;// 0x4978(0x0160)
	struct FAnimNode_FaceCustomization                 AnimGraphNode_FaceCustomization_8CE6AA7E47EDFA429B5D9CA76589BF8F;// 0x4AD8(0x0138)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_160B85184603005E14F06C9098D0F318;// 0x4C10(0x00E0)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_4BC16D97446C4BFF9CA0668F0DEFAF67;// 0x4CF0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_53BBBADE48B1321D31B0DB8D2AA03FEC;// 0x4D38(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_457EBEDD45C5643A212B4EB5448EF4AC;// 0x4D80(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_9FC70CB94A3803BA9369DA9C5877A818;// 0x4DC8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_4F44779B4B3021544554148D1874FF42;// 0x4E10(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_428265A84877F1DED437FB9C3D8B5FB4;// 0x4E58(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_544EC84D498FDD7A67A26C80A8FD0831;// 0x4EA0(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_557E9B7E438FE6339DB79BB5FE16A2E8;// 0x4EE8(0x00B0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_6EFBC91E4A20D40E677A7293F1E40648;// 0x4F98(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_691413A441E5619782C48EAFCDBDDBC6;// 0x4FE0(0x00B0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_698A861F4629C0C02E51F9A973CC20F6;// 0x5090(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_84A3FBE24CD2F7D43B5F18A75866CA26;// 0x50D8(0x00B0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_BB79590D46C5039C652B3BBA8DACAA66;// 0x5188(0x0048)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_A24FD3A64178B203E22C17961194C005;// 0x51D0(0x0160)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_9566D6AA4175580C0739A484F77FC887;// 0x5330(0x0160)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_803DFEED4482252192EC80821C06B9D5;// 0x5490(0x0160)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_68A38535442EB4BF92A854BBD500298B;// 0x55F0(0x0160)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_5AF4211244F4276218CF9B954C10931A;// 0x5750(0x0160)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_C1E928144E02D78AACCFB683C875CD73;// 0x58B0(0x0160)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_7B631C0841595103F9308EBFC82CC9AC;// 0x5A10(0x0160)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_8B8D490C41FCFCEA3BE6E3B6C8A5CB4D;// 0x5B70(0x0160)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_0BACF92247753B10825E74AD22474A40;// 0x5CD0(0x0160)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_5DDA71044298AD5441F6D6AF6F70E824;// 0x5E30(0x0118)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_513FE2804D77DD89C922BE88ACE33120;// 0x5F48(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_DC66ACE1458A7EF0E8C30EBE4C558FE5;// 0x5FF8(0x00B0)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_9C2F4B8C4F50F9C4EB20A3B61D1C0E41;// 0x60A8(0x0118)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_5C11F7F6408CE423E9C3B9B48505DC2B;// 0x61C0(0x0128)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_12B3F0DE449EC53DB2CB668351466213;// 0x62E8(0x0128)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_DC790DE84C070208C02511ADFE832036;// 0x6410(0x0048)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_D19232324A9B609F724583915C639832;// 0x6458(0x0048)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_FDBA1AE04B03D9675EC009AEB1074046;// 0x64A0(0x0160)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_8C8961864C2F8CB762483EB8D047C6DF;// 0x6600(0x0160)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_DA8FF8724DC601F2A011C1BC3D758BD8;// 0x6760(0x00D0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_73C8D3804903C02B6920029A3E56A0BE;// 0x6830(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_015C7F734C0DF6FCC4045E813FA0176F;// 0x6878(0x00E0)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_8E6E037A42422CFAC9A1C9A6E5054062;// 0x6958(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_19BE5EF1413605176B49C39B2258A339;// 0x69A0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_5C849C174F520FBC7FE9D1B4B0AE200C;// 0x69E8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_F062AEE749102CC1CF7B50936F0E36DC;// 0x6A30(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C386CE654772983DC1BB059D8A3EA90A;// 0x6A78(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_FDCAEBF6459E08AC9553748D30016A25;// 0x6AC0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_6A94A1C24A15DEFD39AF7AB294AC1404;// 0x6B08(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_F61111234178308C89CF69BBC2E568AD;// 0x6B50(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_92A9D4EA4A8F47ED86D6B88E9ED143EF;// 0x6B98(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_847DBE54428B349417B0F9AE8E33C82D;// 0x6BE0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_FDA881544CE9EE9569BEFEA78F2C7EE6;// 0x6C28(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_320720AF4B7AAACBC4D4FB9DDE334695;// 0x6C70(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_8FD2F44643B79D8390A300B25D9555AB;// 0x6CB8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_A9F8546F461D4ADAB1D2E39DBAE9D69D;// 0x6D00(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_AF1D9AC140D2C7D2DAA2E88D00E50B97;// 0x6D48(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_E787F9C947F3CD1309000EA83E8B6D46;// 0x6D90(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_FC57261047085EBF6B35E2B9D0F61D14;// 0x6DD8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_D3C0E4B94C62EA7739F93A877DA1F8FF;// 0x6E20(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_E4CAD0B64A4059CD128B259C0FC14AF2;// 0x6E68(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_3452DB04468A8D98331EE799EEED5585;// 0x6EB0(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_671E950A40D76B4CCBDC78A64BF05DE1;// 0x6EF8(0x00B0)
	struct FAnimNode_TwoWayBlend                       AnimGraphNode_TwoWayBlend_0199039A41FB715EC0C530B9402ECEBB;// 0x6FA8(0x0120)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_F1C3498148F903B308A10BAF85320915;// 0x70C8(0x0048)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_8D67B7DE457C11E3B384B5928852FE3A;// 0x7110(0x0048)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_DFDB47BF4EA1C9A5965F9BBE8988E8CC;// 0x7158(0x0048)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_BCEC5C264F6D67CF6E1C79B828B810C5;// 0x71A0(0x0160)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_BFF3D6EF4B620FBA8122FC8CC27DD07A;// 0x7300(0x0048)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_854A55844C303B051FD152B5E7A813B4;// 0x7348(0x0160)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_43717FB740DEC1230C8C29B18E8AA160;// 0x74A8(0x0160)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_CFE810024EDF244BF4C3198BC6F82D56;// 0x7608(0x00B0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_AECFAE4D4EE3BA411D2177AC3A5AFADC;// 0x76B8(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_64E773A44C67860E8D3EC1BE16DDE1E1;// 0x7700(0x00B0)
	struct FAnimNode_TwoWayBlend                       AnimGraphNode_TwoWayBlend_0B1780A54F5E3E895FFCDB8DA6D3D2B1;// 0x77B0(0x0120)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_4EBE75C34D12C2C2928A22A9272AC6FE;// 0x78D0(0x0048)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_ABD35536419AC6544C8B618B4CEF6C04;// 0x7918(0x0048)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_56A2F6164936D95746922992FAEFCF31;// 0x7960(0x0160)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_987F8F844F75DE2596E39B83F001BC44;// 0x7AC0(0x0160)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_7F50CFE04B0014C6617F81937ECB88A8;// 0x7C20(0x0048)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_8659573F413F72611A8CC68EB6B496A1;// 0x7C68(0x0048)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_1AAE465E4282E19CBBD470BF3059E34F;// 0x7CB0(0x0160)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_2986EEA14B0ACF2FCFA74BB1203169D0;// 0x7E10(0x00B0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_4570BDBE470B2EA1B19B41B9FB91EACD;// 0x7EC0(0x0048)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_35E270054AA45BDEC34698B74D057884;// 0x7F08(0x0048)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_0FD130054396DC83E0D27D86397447CA;// 0x7F50(0x0048)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_2F0D700E43212E8FE0A35788B67E8E5F;// 0x7F98(0x0160)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_0422F9F147EDB8AD858A06B66401F212;// 0x80F8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_50D77ACF4B5ECE3B7D58DC995B9E2E34;// 0x8140(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_702674B2464E723193A2758B20954E86;// 0x8188(0x00B0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_A78C0D674E1A92A2372CBFB2F0CBF564;// 0x8238(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_A97A799B4AEA195E987D53ADCEFE4C04;// 0x8280(0x00B0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_31B861A946221D9D377D1AA8E7C264B3;// 0x8330(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_9F91FD64438302A4DFC54BA78D092A42;// 0x8378(0x00E0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_D4BC5F6B4581C27A526D1283E593704D;// 0x8458(0x0048)
	struct FAnimNode_RotateAroundPivot                 AnimGraphNode_RotateAroundPivot_6B04EF3F498122AE58FEBCA4B7F3765A;// 0x84A0(0x0150)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_E32665FB45310AD0F29DE284C0BDAFE0;// 0x85F0(0x0160)
	struct FAnimNode_CopyBone                          AnimGraphNode_CopyBone_363CFA8C478F80D2C7540A8BD4723B8E;  // 0x8750(0x0150)
	struct FAnimNode_TwoBoneIK                         AnimGraphNode_TwoBoneIK_15E7E9944A1F28692FCFFE9CB56DBB03; // 0x88A0(0x0270)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_4B3D2F794F032B1677BED19FAB44E197;// 0x8B10(0x0160)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_2D478C78409C56ABE8F398B5DD8462CF;// 0x8C70(0x0160)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_2B1B3D6D4092690FDF01CFBAC65AEEFA;// 0x8DD0(0x0160)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_9AB7702B40A915C7D9FACF944477723A;// 0x8F30(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_BB4EB0714B3F5FC10866EDB0FDDB4848;// 0x8F78(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C3F78F5047A9526A5A6FF698A871116D;// 0x8FC0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_50CA56AB4E7960D70DA0F883A1223663;// 0x9008(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_E61ABE7049AD0F0C318F899908AFB2DE;// 0x9050(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_B57F16F64454230F5761E98DF8CC98A1;// 0x9098(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_81BF16984081A53E0761269215A12E83;// 0x90E0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_8BC970AE4BBF8804FAB69DB0B9D72C87;// 0x9128(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_8DD8B3B04D0017AD6EE2F2B7D9AC7139;// 0x9170(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_707A58B448E85478CC35129623D585EB;// 0x91B8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_9F485EB0465130C6DFEA9EB278DCC68C;// 0x9200(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_931F7E3A410906147DE8AEBBF62C0A08;// 0x9248(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_3C572FFB467B39B6D5EC5ABCD3080A4F;// 0x9290(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_8411A757438057C1ACA3B399E08153A9;// 0x92D8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_478DB20C4AD2E0506FA75FAA21AB2EDE;// 0x9320(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_E19592134C061C077D468E8121871759;// 0x9368(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_3A4C206041D7CCE4F9A52E9E6B08DEF5;// 0x93B0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_EEFE0C284590EACB0F590AA3B2B77E45;// 0x93F8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_D8C3A913468B2621A89EEBAB519D1ABB;// 0x9440(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_3B3AF96940B999EF19EAF1A8CA8F3B9B;// 0x9488(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_5692AA004477968A8D84B6BBA08C2BDA;// 0x94D0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_E7FEF38A4D51810686A2678AFB5A29AA;// 0x9518(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_07C3F0E44399AF282683C9B6970C3D9E;// 0x9560(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_F2E0A88F4550ABAC0005F9A1197521D8;// 0x95A8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_41E3C54A47E5151D06443B91C34D5409;// 0x95F0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_F349B84B4E949F0E123A9B9A26A11C05;// 0x9638(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_2994292F477EAFB6F79F009B36FE37CE;// 0x9680(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_D0529DFF4A72CE3025E6D48A3F2E1DEB;// 0x96C8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_70415063462C2517A68070B1E1521DE3;// 0x9710(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_389F81ED4B5801F421FEBEADF592D97F;// 0x9758(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_8C0367114D9D9B0B1C57A68DF4925E9F;// 0x97A0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_87678704444090B1A3CBB0B46AEF47AD;// 0x97E8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_EE58C0684F482DE58232F0B7AAB4712B;// 0x9830(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_19A0046C486A8F281AB483A386963608;// 0x9878(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_8FCFD0724836C0ED3BC6B3A1800DA237;// 0x98C0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_51F7EA974F2BCA0C271C72BBA1576FE0;// 0x9908(0x0048)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_E00C66054E6EF7647D04978C3D9D998B;// 0x9950(0x0128)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_5736F22F4597A52A2152A8A1CEBF1AAA;// 0x9A78(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_68C4729C47A0E3A5659AA0B6408AE959;// 0x9AC0(0x00B0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_F9C2A3B3446CD6CF5A7776A58AFD0EDF;// 0x9B70(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_5F7329314AB4AFE1899A0DA7186F5D3E;// 0x9BB8(0x00B0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_39A8AD46430D65EBAD66298AAC545A45;// 0x9C68(0x0048)
	struct FAnimNode_RefPose                           AnimGraphNode_IdentityPose_6A58415F4DF9A2ABB14CB5A3F362E011;// 0x9CB0(0x0038)
	struct FAnimNode_TwoWayBlend                       AnimGraphNode_TwoWayBlend_1309EBFB444A0D3F862309A49FCBA18F;// 0x9CE8(0x0120)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_E64DF0C44FEAFB7AA52CBF96DC96A71E;// 0x9E08(0x0128)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_E2B751494494B89E1C8DDF99CC16BE37;// 0x9F30(0x0048)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_F2B585604045651FF8BF45846A6BD9EC;// 0x9F78(0x0128)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_F738E8DE42833C8C28468490EA5C1D17;// 0xA0A0(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_5E3D17DF4029665B0F1C06BBCC480812;// 0xA0E8(0x00B0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_E3526BBD4DA5488198C49EA802086CD3;// 0xA198(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_B5343580463BF3FDB2063089070227C6;// 0xA1E0(0x00B0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_2553523A4ECFAB2312F5BC81155A0F25;// 0xA290(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_898BE28443F461A9FC614E9FBB10A187;// 0xA2D8(0x00B0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_F5D5E8944398E10584A5D0BBFEAC9D93;// 0xA388(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_D79746EE49B7D548B6AAF2BC40A6C100;// 0xA3D0(0x00B0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_7E4216D04FF4176BA01601BD0D97E7AD;// 0xA480(0x0048)
	struct FAnimNode_TwoWayBlend                       AnimGraphNode_TwoWayBlend_9059E1824FA49318A87ADA8F917461D2;// 0xA4C8(0x0120)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_E416DFCF4A1CD9BCAA2A7AAD47041F49;// 0xA5E8(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_5A00DD7C4A65962D326302ABCBB6EFFF;// 0xA698(0x00B0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_7CAE14774CE9B31DDD9CB88090985AD3;// 0xA748(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_59E05EF84AF00E1789EFB59044867605;// 0xA790(0x00B0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_AC192650497D5C1A0B01CAB1D9505031;// 0xA840(0x0048)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_BE3ABC7C452E9891F19BC9B7AAC358CE;// 0xA888(0x0128)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_4EB63A7140C614B2A8A5A5A2F16B726D;// 0xA9B0(0x0048)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_F1B12A984EF47F79EE6B238B48386D2A;// 0xA9F8(0x0128)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_43D1BF694CB8E3E1469043B8239D8848;// 0xAB20(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_08B5F0DB46F5E9E9914779B04A14D655;// 0xAB68(0x00B0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_34CDE98144F7DB66AA29668079AC014A;// 0xAC18(0x0048)
	struct FAnimNode_TwoWayBlend                       AnimGraphNode_TwoWayBlend_5C7E5D0249BF3F9A402A439F8D5456BE;// 0xAC60(0x0120)
	struct FAnimNode_RefPose                           AnimGraphNode_IdentityPose_9E593C894E4AC3CCFDACAABF5B15BB32;// 0xAD80(0x0038)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_B760AC77477CE45D2951709C4D1F9191;// 0xADB8(0x0128)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_988981C54C4FDD6896531DAE1B7A617C;// 0xAEE0(0x0048)
	struct FAnimNode_RefPose                           AnimGraphNode_IdentityPose_E3BE7314480A049A943DF78C955B602F;// 0xAF28(0x0038)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_C33385BB4E7F4CC4EB2469BB52B32C0D;// 0xAF60(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_62D5F86B43F35D42C212758E47C15DDC;// 0xAFA8(0x00E0)
	struct FAnimNode_AttackAngling                     AnimGraphNode_AttackAngling_1525F98341EBE049B15EFEA98A7F480A;// 0xB088(0x02A8)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_927F2EBD4DEF93D4387449A6F10269D2;// 0xB330(0x0160)
	struct FAnimNode_TwoBoneIK                         AnimGraphNode_TwoBoneIK_7D4D767F4CC945632D6890AACCB0531C; // 0xB490(0x0270)
	struct FAnimNode_CopyBone                          AnimGraphNode_CopyBone_B9CB232D48F900C944703CB755D14BA6;  // 0xB700(0x0150)
	struct FAnimNode_CopyBone                          AnimGraphNode_CopyBone_5A14DEB84279A61BC469A8B816068AD1;  // 0xB850(0x0150)
	struct FAnimNode_CopyBone                          AnimGraphNode_CopyBone_82F1885D420BC69E09E50A93519C8450;  // 0xB9A0(0x0150)
	struct FAnimNode_CopyBone                          AnimGraphNode_CopyBone_A327B58047C73CB4A8D9D38663606E66;  // 0xBAF0(0x0150)
	struct FAnimNode_CopyBone                          AnimGraphNode_CopyBone_484041314A3FCD0FBD19A295D1F37E6C;  // 0xBC40(0x0150)
	struct FAnimNode_CopyBone                          AnimGraphNode_CopyBone_8952A3484C8BB5283492A1A4D468BD47;  // 0xBD90(0x0150)
	struct FAnimNode_CopyBone                          AnimGraphNode_CopyBone_C02AB4CD4E87E9B55DA61492191B261C;  // 0xBEE0(0x0150)
	struct FAnimNode_CopyBone                          AnimGraphNode_CopyBone_E89F8D5442A22F91CE6BBA9F252AF519;  // 0xC030(0x0150)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_96ABA03545E30A09EBB14AA2D6CE747E;// 0xC180(0x0048)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_F3B35D53418DAF0D7A691AA00689B1F9;// 0xC1C8(0x0048)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_BA10333B4568F5110886ACBCD17D538C;// 0xC210(0x0160)
	struct FAnimNode_TwoBoneIKOffset                   AnimGraphNode_TwoBoneIKOffset_B09EE86E451242D4CFB41CBCD7B6FC6D;// 0xC370(0x02A0)
	struct FAnimNode_TwoBoneIKOffset                   AnimGraphNode_TwoBoneIKOffset_A1CF803949B0969CB7B2BBA83C2BB75E;// 0xC610(0x02A0)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_7268F94C4D4BF2A004408C92EF9795B7;// 0xC8B0(0x0160)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_6EC12CBC4FD07FBD66254F97D286ACDB;// 0xCA10(0x0160)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_495A6E794CF4D606EDDFF894A5FDBF64;// 0xCB70(0x0160)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_653FA75F47D93D306BD15F84D76B5809;// 0xCCD0(0x0160)
	struct FAnimNode_CopyBone                          AnimGraphNode_CopyBone_EAFFA10F48A37B187C61438CBC326BB6;  // 0xCE30(0x0150)
	struct FAnimNode_CopyBone                          AnimGraphNode_CopyBone_61A6E64642CDAFC0AA04E29ACF369A9E;  // 0xCF80(0x0150)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_379E7BBB4E6DD6446F32F5AB8EE99887;// 0xD0D0(0x0070)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_6F771663430412AFF8A8B2932C6083D6;// 0xD140(0x0070)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_B33C28FF437757994A0E7AAD785AE911;// 0xD1B0(0x0118)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_B491061F4874AAA662A2ACA840C4A63D;// 0xD2C8(0x0160)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_A56554104EC680FF5BEC7A9A17B9CC17;// 0xD428(0x0160)
	struct FAnimNode_CopyBone                          AnimGraphNode_CopyBone_6B163C4249918AB05322B283AC920312;  // 0xD588(0x0150)
	struct FAnimNode_CopyBone                          AnimGraphNode_CopyBone_F94DC43B4FFE9228B2BE3484E87D07C2;  // 0xD6D8(0x0150)
	struct FAnimNode_CopyBone                          AnimGraphNode_CopyBone_86949D184F3EFBCA80D3CC83786A07B2;  // 0xD828(0x0150)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_4996AC6F4D9083DDA0872FA95C39BF93;// 0xD978(0x0160)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_D53F5641440C2410B2130DA79A0BEC7E;// 0xDAD8(0x0160)
	struct FAnimNode_CopyBone                          AnimGraphNode_CopyBone_1D386DD74AAA635BE9797B90A5876557;  // 0xDC38(0x0150)
	struct FAnimNode_CopyBone                          AnimGraphNode_CopyBone_D6E83F7D4B30E49AB388AFADDFB57822;  // 0xDD88(0x0150)
	struct FAnimNode_CopyBone                          AnimGraphNode_CopyBone_06F0ED1C43E8C160DFFBD5977FE70A1E;  // 0xDED8(0x0150)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_5CF5A23049C9DDBB9B89B8A7B2429B3E;// 0xE028(0x0160)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_2516FD47441137093A3501AAAEB5D478;// 0xE188(0x0160)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_3AE85A68440BBBBFF74595B487268997;// 0xE2E8(0x0160)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_E2AB24CB403F96FA28F980814B929523;// 0xE448(0x00E0)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_22C276124292B1B2393F2BAA7A744867;      // 0xE528(0x0070)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_67BB5400434D49EAF4C4FF8F78BE4440;// 0xE598(0x0048)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_D7E75AB44F1C4FC46E4D2EB56A9EE8AB;// 0xE5E0(0x0048)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_95A0991648C08D46DBA4BAB9D539EE3C;// 0xE628(0x0048)
	struct FAnimNode_RotateAroundPivot                 AnimGraphNode_RotateAroundPivot_E2C34F3245D9F2DE00881EB769E510A4;// 0xE670(0x0150)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_72721A424CE5B5C16124B0931E9E319A;// 0xE7C0(0x0160)
	struct FAnimNode_TwoBoneIK                         AnimGraphNode_TwoBoneIK_7C4E186045C25BFDFC5E3EB0EEB0B3DC; // 0xE920(0x0270)
	struct FAnimNode_CopyBone                          AnimGraphNode_CopyBone_93EDC8494270F54DA3C888A930E5112B;  // 0xEB90(0x0150)
	struct FAnimNode_TwoBoneIK                         AnimGraphNode_TwoBoneIK_FEFC3BDA42E6B237807CD283C8C0D409; // 0xECE0(0x0270)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_5D6658F9407D8173A73B48BBC3165347;// 0xEF50(0x0160)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_B60288AF4E81110D54012E959687EBB8;// 0xF0B0(0x0160)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_FB5AFBE0404ED1C0F10F728D67FA9189;// 0xF210(0x0160)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_D2C9901D494A32C053F23785C1F50FD5;// 0xF370(0x0160)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_0B2DE327466BCD2C1C8F56B921F22EDE;// 0xF4D0(0x0160)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_23FE189741A508D6CD049CBAEDC8BBE6;// 0xF630(0x0160)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_E397D49D44A698CAC654BD9D5CF36DC8;// 0xF790(0x0160)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_4DFA671E487810A2D066AB93AF5C1D80;// 0xF8F0(0x0160)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_740384FB4A9BD56A63333D9C3682A5DE;// 0xFA50(0x0160)
	struct FAnimNode_RotateAroundPivot                 AnimGraphNode_RotateAroundPivot_F4BAF8EF46F8F17AF094CB9FDD163F96;// 0xFBB0(0x0150)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_1981B97045640DF57DFB4A93C3581089;// 0xFD00(0x0160)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_3EDAE46B41DFB3AB5A88CF965BE07BC8;// 0xFE60(0x0160)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_41D41E254B61569EAD682588EE074AD0;// 0xFFC0(0x0160)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_1EF1F78A4B4F441BAC34959F688A15AC;// 0x10120(0x0160)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_28EEFD2D44AD125EC0E0209CE1B94509;// 0x10280(0x0160)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_BC37F13143D9AE17569BC6B2FBCE3E70;// 0x103E0(0x0160)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_CD979AA944E88B1F3921E587305C22AD;// 0x10540(0x0160)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_D3136F5D4710ED98BA33E2B91972030B;// 0x106A0(0x0160)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_9F0FA0E94FBE8D7162FD62B80F3C74C5;// 0x10800(0x0160)
	struct FAnimNode_AttackAngling                     AnimGraphNode_AttackAngling_3E9E17454F02EF4B5ECD94875CFCC24C;// 0x10960(0x02A8)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_817A7DC240806F2D8EE684B6DE8FA74D;// 0x10C08(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_0CE1BD844FE4816ECF2F6F9BD049B345;// 0x10C50(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_AD984F0F4FB46A2F6126F7B69F89DB54;// 0x10C98(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_FF910D30464379CBF5EC4EB3B280E3D8;// 0x10CE0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_537B7871491A445AA0BBA68CC6542558;// 0x10D28(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_AB3B51624860FCBF6273C2B820518A47;// 0x10D70(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_724E107B433CE5BF3C85F785F474AEC8;// 0x10DB8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C5A219864993064582F27C9DE487E1DF;// 0x10E00(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_9360ADEB49C80DF37F38CC9F894C9CBF;// 0x10E48(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_86718B5149A588BCB19EFAA1EC3D7514;// 0x10E90(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_3685028146A13828CD9F9E83DC5CC888;// 0x10ED8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_00D371994D0CF15D257A549C57223727;// 0x10F20(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_A1423B324FFFD955A54F448D15E66DA2;// 0x10F68(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_F1F3114B43E27C98BB01E99943BCB87F;// 0x10FB0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_0B8F6D724251A7DE392BCDA5523457C7;// 0x10FF8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_92FB67A84D90A055E42AFEAADF02F276;// 0x11040(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_DDE528C9464FE00C8E51F3811D4BB80B;// 0x11088(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_6DF8766240F710E0B8B688B3AF013CFB;// 0x110D0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_36C2B1FF490542A2A9BDD48CF2885A4A;// 0x11118(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_3D7626974CDB58D77A34B09401FA0CB5;// 0x11160(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_4E2E80CB4FD0D7658A4FF89B7FE57BF6;// 0x111A8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_0B6E5E0240641EBE5911919F4B838F4D;// 0x111F0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_194325BE415EC89D0F3D40B10BA56E5D;// 0x11238(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_A57EEED341B21AF4E3C404A82CA991EA;// 0x11280(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_F046862148325ECE197C9FACC12970C3;// 0x112C8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_0772966547F528EC2498BFB2F94B93D9;// 0x11310(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_7117035F4AA5211F6E5A99B2227C10BB;// 0x11358(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_A3849AE0454C83895E245A8942815E4E;// 0x113A0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_A8B370C540C250BB8316E084D9AE8C1B;// 0x113E8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_D0A5126842EC6B28C7CBC8A784935AEB;// 0x11430(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_29F0C7E1418B8474418AF29B71AEA4BD;// 0x11478(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_6C578A8045693295E5E1B89E8BDF9B8F;// 0x114C0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_6588BD264576B5F1CCFAD3B443FD3568;// 0x11508(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_5C735F5D4DA365FA3F82B7A917BEC95B;// 0x11550(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_EA46C0FC45F6E7F83414C09986945704;// 0x11598(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C8DCA4E844F3E580DB0E89B27B636B96;// 0x115E0(0x0048)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_9691602E4F7679022D01AF9F447A4431;// 0x11628(0x0128)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_7DB9D82F46DA85070738F78DD4E8485D;// 0x11750(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_959697F2400AB0EDEEA1EE91BA4C35D9;// 0x11798(0x00B0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_C40FCC814558419538BBB08C99C8769D;// 0x11848(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_31CAF8D645841C0C551F8D9B413FE7A2;// 0x11890(0x00B0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_7EA39379428B775050CA0EAADE6A79FB;// 0x11940(0x0048)
	struct FAnimNode_RefPose                           AnimGraphNode_IdentityPose_1395044441132244D9FFC09C1F3B1EC9;// 0x11988(0x0038)
	struct FAnimNode_TwoWayBlend                       AnimGraphNode_TwoWayBlend_D1FCC0924F6437E7633B4C85466F1E4D;// 0x119C0(0x0120)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_F67B7D034331E6498C14C6B5B0027678;// 0x11AE0(0x0128)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_D6E520ED47334AE311E8E8BB011405CA;// 0x11C08(0x0048)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_DD4E175349252B1BCC8ED5B243740C5D;// 0x11C50(0x0128)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_7F3F3F284CF3D80AF32E07A6C4F3911C;// 0x11D78(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_20B2D08D4EA6EB6E084956BAC135E3B6;// 0x11DC0(0x00B0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_E791C1804F6838BBC708B186E20F19A2;// 0x11E70(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_B1D49D3C4B929AEA88516CAC919A7451;// 0x11EB8(0x00B0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_8108CB8A4DBE8B09E49F80A73A62633B;// 0x11F68(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_5ED720024E77862099AA84A22C382C00;// 0x11FB0(0x00B0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_530837264A59FFA81CC9048E9656E819;// 0x12060(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_35DF5502479BD3F9C89473BF3D165948;// 0x120A8(0x00B0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_65239CD54E1AF89364C84BB5CBC7E9AD;// 0x12158(0x0048)
	struct FAnimNode_TwoWayBlend                       AnimGraphNode_TwoWayBlend_CE149A36406451EFA2F67B9F37B3555A;// 0x121A0(0x0120)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_915BF7F1460A7CE0B2F461AA48E2DEAE;// 0x122C0(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_400C0A3D45F78807B286E59A8DBC28AF;// 0x12370(0x00B0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_9DC25155451E8159A8B8D7B60799FBFF;// 0x12420(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_E391588C42325B48B26FE98113DEFD09;// 0x12468(0x00B0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_A4C0B5E94078A4F42473C4809359CC90;// 0x12518(0x0048)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_D7F2523B4D813AECDC1842943CF7E0E9;// 0x12560(0x0128)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_1DE0BE4A4187D6E9164A81948B4ED85E;// 0x12688(0x0048)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_5A75A00B4EEB28E2D56E1696E6685055;// 0x126D0(0x0128)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_FE5132FF41D37C6618D774802181156B;// 0x127F8(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_B8D004A9474D921DE77532A24F2713DB;// 0x12840(0x00B0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_56F4B1A149637BF84F8EB291B39F8452;// 0x128F0(0x0048)
	struct FAnimNode_TwoWayBlend                       AnimGraphNode_TwoWayBlend_0B3B3C84471B130AC1B45980F510381A;// 0x12938(0x0120)
	struct FAnimNode_RefPose                           AnimGraphNode_IdentityPose_0B39525E41200087210D7190C972D228;// 0x12A58(0x0038)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_49F6169C495EE00C8E04B7B31357CEEA;// 0x12A90(0x0128)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_AA94170F44D888AB5CA3CE88F48607F5;// 0x12BB8(0x0048)
	struct FAnimNode_RefPose                           AnimGraphNode_IdentityPose_D337A6E942AEE0AA6CADCF8FDBF6DE6C;// 0x12C00(0x0038)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_583A49634E695F80CE976196509FAAE0;// 0x12C38(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_5CE8478347A35D31D7049BAF4C594764;// 0x12C80(0x00E0)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_3FEAAC494F03FCCC92574B8C7856A54F;// 0x12D60(0x0160)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_0F6B8D6041D3037C88DF1ABECCDCD42F;// 0x12EC0(0x0160)
	struct FAnimNode_TwoBoneIK                         AnimGraphNode_TwoBoneIK_E8C8E0E14D73D02DF8BD14A36C164FEB; // 0x13020(0x0270)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_62D22E5D4F53EB037D35198D6052327F;// 0x13290(0x0160)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_FF4ADFE345B3092F0BA8988CA1AA174B;// 0x133F0(0x0160)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_7D80254E4698BC780CF42C842D79A1BC;// 0x13550(0x0118)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_E2338E8943F41EE2559DBDA73BA76BFF;// 0x13668(0x0160)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_2180010747A6BE270F70D2B674BA7283;// 0x137C8(0x0160)
	struct FAnimNode_RotateAroundPivot                 AnimGraphNode_RotateAroundPivot_7860931D49314460852295970615FF11;// 0x13928(0x0150)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_3B788FB549EC6F09096B58A7D73F0DF7;// 0x13A78(0x0160)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_27CCADD34ED9584FAB738FB6D4966E8B;// 0x13BD8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_8B08C20844DE2C22BB543DAF2FC1C2FB;// 0x13C20(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_F25BFC8C4BACBBEA9E9EDE95D4E301F9;// 0x13C68(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_549A5159406FC57BEE7FDD93A24B4531;// 0x13CB0(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_8CC4B66E4B905A09CEF38B89D74789FE;// 0x13CF8(0x00B0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_9D90CE214C94AEB43E33FFA63EF61ACA;// 0x13DA8(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_F8E612354903F65AB854EF9FB9BC88CC;// 0x13DF0(0x00B0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_E093D2EC42D7238B3DF877B73A632C1D;// 0x13EA0(0x0048)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_B28A6BFF41C9AF549A2B4E85C6E23896;// 0x13EE8(0x0048)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_CDD8EA124DA17F821DC1CCB4E9007D39;// 0x13F30(0x0048)
	struct FAnimNode_BlendSpaceEvaluator               AnimGraphNode_BlendSpaceEvaluator_F278C6B1442122AB2859D6947D8ACF8B;// 0x13F78(0x0130)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_EEBCB4F84222C2E12DF0FA96D0BCD6A2;// 0x140A8(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_E802C4954318103D1EA751BEFB8BFE18;// 0x140F0(0x00E0)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_B33644C14A2CCCBC863753B423E97E54;// 0x141D0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_77A2805A4F65CB3661C2AB9C70AD973D;// 0x14218(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_B5C097DA48F8957718621B971D33965C;// 0x14260(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_6F1DCDF845858000AB1BDDB31C15DF9F;// 0x142A8(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_4750FEB84476D2EC397286835B539CE4;// 0x142F0(0x00B0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_714E20C641A8368D9A278DBF9762C2C4;// 0x143A0(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_5E8C9601495536041DF41FB639ABC7BA;// 0x143E8(0x00B0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_9457FA454772598DA256CAB5F6520130;// 0x14498(0x0048)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_0C24B7AB48083984786C61AD35BC9353;// 0x144E0(0x0118)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_2986312545B60FF643C4C3A0CBBEF32F;// 0x145F8(0x00B0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_9794D1374A7F98648DF88B8FC2144C71;// 0x146A8(0x00B0)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_08F32ACF4DBDA5CC09FBC3BBE56C233C;// 0x14758(0x0118)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_0824004A4999957ED29E4195DCFA4C89;// 0x14870(0x0128)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_16E57B0C46137D9C56679E98F48660CC;// 0x14998(0x0128)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_4CB5B63A48B10E688F0C89AC3B9B3162;// 0x14AC0(0x00D0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_2E7DBF8340CCEE127C3C698D47D1C849;// 0x14B90(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_B9A431964A965786A0684491CA1A560B;// 0x14BD8(0x00E0)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_5468A12A4A2A4EF027679EB5EACB2612;// 0x14CB8(0x0160)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_8E5B4CF4403446F5838138BB7181F759;// 0x14E18(0x0160)
	struct FAnimNode_CopyBone                          AnimGraphNode_CopyBone_6C492FFA490317CF6EE01B8EDE7420FD;  // 0x14F78(0x0150)
	struct FAnimNode_CopyBone                          AnimGraphNode_CopyBone_58DB421F40B2C37575C781BD9481EA5B;  // 0x150C8(0x0150)
	struct FAnimNode_CopyBone                          AnimGraphNode_CopyBone_8D960BD9419A6822DA6046A2DA7A055A;  // 0x15218(0x0150)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_85EA8ABA4F56C9189BD4F8B33B7C722B;// 0x15368(0x0160)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_C968AFF94958F30BB669008FA664812D;// 0x154C8(0x0160)
	struct FAnimNode_CopyBone                          AnimGraphNode_CopyBone_23AD6C0A464870A67A64758E94503DC8;  // 0x15628(0x0150)
	struct FAnimNode_CopyBone                          AnimGraphNode_CopyBone_C82B30FF42323966AAAD65B7E582EDE6;  // 0x15778(0x0150)
	struct FAnimNode_CopyBone                          AnimGraphNode_CopyBone_55F4CD9A42BD2D308F2DFDAAE867927B;  // 0x158C8(0x0150)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_67FE8A144AAE7B689A14D2A4AA524A83;// 0x15A18(0x0160)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_5D5E3F53498A7AA1F23E34990F9F4CAB;// 0x15B78(0x0160)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_E9477DA9423D4361B2ABCD9726A80346;// 0x15CD8(0x0160)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_2663FF614217772FEF2C1D882799C53E;// 0x15E38(0x0160)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_1775ACFB401A351E7BA1B3A1337BD9C3;// 0x15F98(0x00E0)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_229738B444FE074AD50AECBE5455A313;      // 0x16078(0x0070)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_CE856597426B0C14F7415780A16CDF16;// 0x160E8(0x0048)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_C0D04A534E8BDC1642CBDCAF7F9A9F6F;// 0x16130(0x0048)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_1CBD41BD4B54CE27BAB417924AB79F7B;// 0x16178(0x0048)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_EE2DAFE94A49E5C5592CC8973F72F969;// 0x161C0(0x0160)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_8714E71C451D13BD73EC659A91AE9B82;// 0x16320(0x0160)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_974ADB03489E3A85F19E519C4042AA19;// 0x16480(0x0048)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_32BC3336437D90A46C0A45B463BB3D56;// 0x164C8(0x00E0)
	unsigned char                                      UnknownData01[0x8];                                       // 0x165A8(0x0008) MISSED OFFSET
	struct FAnimNode_TwoBoneIK                         AnimGraphNode_TwoBoneIK_D71A009046D2D78E7EDAA484F5FF1ED4; // 0x165B0(0x0270)
	struct FAnimNode_TwoBoneIK                         AnimGraphNode_TwoBoneIK_23A7C576457BE81CEC50D2A5351020DC; // 0x16820(0x0270)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_49CBC6E74BB54B0A231F1A93CC9A1C6A;// 0x16A90(0x0160)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_A08D15964F08C2F58EC87F805A8C8D5B;// 0x16BF0(0x0048)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_67DB726146EC0B98730855BDE98FC67F;// 0x16C38(0x0128)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_DA30D1094110816E20A904BA396D15B3;// 0x16D60(0x0128)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_6BFA4C3C4C30D6E45BBCBC893BECCF40;// 0x16E88(0x0160)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_FDB5E6E9406B35228F737D9F76BEE0FB;// 0x16FE8(0x0160)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_C342AAE3429EC4F6D40C04B605A544FA;// 0x17148(0x0160)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_9080C2744337AAF26E9C3C8DF3D39C1E;// 0x172A8(0x0160)
	struct FAnimNode_TwoWayBlend                       AnimGraphNode_TwoWayBlend_82413B0E410D90755BB301807D21D059;// 0x17408(0x0120)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_3B35041A4D2DA21F6FE031B0ECB14A4B;// 0x17528(0x0160)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_C2ED736A455C6441A81A95B82F022BD2;// 0x17688(0x0160)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_D3E17D044464342D06AC1DAD8E49ACCF;// 0x177E8(0x0160)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_A8C4A7C541BB61F7F3B37D8DB6CBEC3A;// 0x17948(0x0160)
	unsigned char                                      UnknownData02[0x8];                                       // 0x17AA8(0x0008) MISSED OFFSET
	struct FAnimNode_TwoBoneIK                         AnimGraphNode_TwoBoneIK_33DD6EEC4F3D3176B4AA0C9EE1876A87; // 0x17AB0(0x0270)
	struct FAnimNode_TwoBoneIK                         AnimGraphNode_TwoBoneIK_78DD77484E9FDCF531CC79B0F55C712B; // 0x17D20(0x0270)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_070FAB8D487153BBF42CDA9D7284E36E;// 0x17F90(0x0160)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_C947474645A9B872217929B0A50B5E26;// 0x180F0(0x0160)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_5C5640C8426DC25956C02CB3EAF29497;// 0x18250(0x0160)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_AB2B7AC64716D867E57B1D88E87153CE;// 0x183B0(0x0160)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_AC51A0404473DE7A1EB738953CD58818;// 0x18510(0x0160)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_76F2BDC642C39E1F03C41B87CF9CC1F6;// 0x18670(0x0160)
